Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Components/ExchangeRates/DenominationGroupDialog.*.resx
Languages: ms, th

source: Add Denomination Group
ms: Tambah Kumpulan Denominasi
th: เพิ่มกลุ่มชนิดธนบัตร

source: Edit Denomination Group
ms: Edit Kumpulan Denominasi
th: แก้ไขกลุ่มชนิดธนบัตร

source: Currency
ms: Mata Wang
th: สกุลเงิน

source: Group Name
ms: Nama Kumpulan
th: ชื่อกลุ่ม

# GroupNamePlaceholder
source: e.g., Large Bills
ms: cth., Wang Kertas Besar
th: เช่น ธนบัตรใบใหญ่

# GroupNameHint
source: A descriptive name for this denomination group
ms: Nama deskriptif untuk kumpulan denominasi ini
th: ชื่อที่อธิบายกลุ่มชนิดธนบัตรนี้

source: Denominations
ms: Denominasi
th: ชนิดธนบัตร

source: Enter denomination
ms: Masukkan denominasi
th: ใส่ชนิดธนบัตร

# DenominationHint
source: Add bill denominations that share the same rate
ms: Tambah denominasi wang kertas yang berkongsi kadar sama
th: เพิ่มชนิดธนบัตรที่ใช้อัตราเดียวกัน

source: Sort Order
ms: Susunan
th: ลำดับการแสดง

# SortOrderHint
source: Lower numbers appear first
ms: Nombor rendah dipaparkan dahulu
th: ตัวเลขน้อยจะแสดงก่อน

source: Cancel
ms: Batal
th: ยกเลิก

source: Save
ms: Simpan
th: บันทึก
