Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Components/ExchangeRates/RateDetailsFlyout.*.resx
Languages: ms, th

source: Rate Details
ms: Butiran Kadar
th: รายละเอียดอัตรา

source: Provider
ms: Pembekal
th: ผู้ให้บริการ

source: Denominations
ms: Denominasi
th: ชนิดธนบัตร

source: Rate Breakdown
ms: Pecahan Kadar
th: รายละเอียดอัตรา

source: Buy
ms: Beli
th: ซื้อ

source: Sell
ms: Jual
th: ขาย

source: Provider Rate
ms: Kadar Pembekal
th: อัตราจากผู้ให้บริการ

source: Delta
th: เดลต้า

source: Final Rate
ms: Kadar Akhir
th: อัตราสุดท้าย

# ShopOverrideNote
source: This rate is a shop-specific override
ms: Kadar ini adalah tetapan khusus kedai
th: อัตรานี้เป็นการตั้งค่าเฉพาะร้าน

source: Quick Calculator
ms: Kalkulator Pantas
th: เครื่องคิดเลขด่วน

source: Enter amount
ms: Masukkan jumlah
th: ใส่จำนวน

source: We Buy
ms: Kami Beli
th: เราซื้อ

source: We Sell
ms: Kami Jual
th: เราขาย

source: Effective since
ms: Berkuat kuasa sejak
th: มีผลตั้งแต่

source: Expires on
ms: Tamat tempoh
th: หมดอายุ

# SelectRateToView
source: Select a rate to view details
ms: Pilih kadar untuk melihat butiran
th: เลือกอัตราเพื่อดูรายละเอียด
