Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Agents/AgentDialog.*.resx
Languages: th

source: General
th: ทั่วไป

source: Commission
th: ค่าคอมมิชชั่น

source: Surcharge
th: ค่าธรรมเนียม

source: Invoicing
th: ออกใบแจ้งหนี้

source: Payment
th: การชำระเงิน

source: Agent Code
th: รหัสตัวแทน

# AgentCodeHint
source: Unique code to identify this agent
th: รหัสเฉพาะสำหรับระบุตัวแทนนี้

source: Agent Type
th: ประเภทตัวแทน

source: Status
th: สถานะ

source: Agent Name
th: ชื่อตัวแทน

# AgentNamePlaceholder
source: e.g. Phuket Tours Co., Ltd.
th: เช่น บริษัท ภูเก็ตทัวร์ จำกัด

source: Contact Person
th: ผู้ติดต่อ

# ContactPersonPlaceholder
source: e.g. John Smith
th: เช่น นายสมชาย

source: Phone
th: โทรศัพท์

source: Email
th: อีเมล

source: Address
th: ที่อยู่

# AddressPlaceholder
source: Full address
th: ที่อยู่เต็ม

source: Notes
th: หมายเหตุ

# NotesPlaceholder
source: Any additional notes...
th: หมายเหตุเพิ่มเติม...

# CommissionInfo
source: Set up how this agent earns commission on referred bookings.
th: ตั้งค่าวิธีการรับค่าคอมมิชชั่นจากการจองที่แนะนำ

source: Commission Type
th: ประเภทคอมมิชชั่น

source: Percentage
th: เปอร์เซ็นต์

source: Fixed per Booking
th: คงที่ต่อการจอง

source: Fixed per Vehicle
th: คงที่ต่อคัน

source: Fixed per Day
th: คงที่ต่อวัน

source: Commission Rate
th: อัตราคอมมิชชั่น

# MinCommission
source: Minimum Commission
th: คอมมิชชั่นขั้นต่ำ

source: Optional
th: ไม่บังคับ

# MinCommissionHint
source: Minimum amount regardless of percentage
th: จำนวนขั้นต่ำไม่ว่าเปอร์เซ็นต์จะเท่าใด

# MaxCommission
source: Maximum Commission
th: คอมมิชชั่นสูงสุด

# MaxCommissionHint
source: Cap the commission at this amount
th: จำกัดคอมมิชชั่นไว้ไม่เกินจำนวนนี้

source: Commission Preview
th: ตัวอย่างคอมมิชชั่น

# SurchargeWarning
source: Surcharge is an additional fee added to customer bookings referred by this agent.
th: ค่าธรรมเนียมเพิ่มเติมที่เพิ่มในการจองของลูกค้าที่แนะนำโดยตัวแทนนี้

source: Allow Surcharge
th: อนุญาตค่าธรรมเนียม

# AllowSurchargeHint
source: Enable this to add a surcharge to bookings from this agent
th: เปิดใช้เพื่อเพิ่มค่าธรรมเนียมในการจองจากตัวแทนนี้

source: Surcharge Type
th: ประเภทค่าธรรมเนียม

source: Default Surcharge Rate
th: อัตราค่าธรรมเนียมเริ่มต้น

source: Hide Surcharge from Customer
th: ซ่อนค่าธรรมเนียมจากลูกค้า

# HideSurchargeHint
source: If checked, surcharge won't appear as separate line on receipt
th: หากเลือก ค่าธรรมเนียมจะไม่แสดงแยกในใบเสร็จ

# CanGenerateInvoice
source: Enable Invoice Generation
th: เปิดใช้การออกใบแจ้งหนี้

# CanGenerateInvoiceHint
source: Allow generating invoices for this agent's commissions
th: อนุญาตให้ออกใบแจ้งหนี้สำหรับคอมมิชชั่นของตัวแทนนี้

source: Invoice Prefix
th: คำนำหน้าใบแจ้งหนี้

# InvoicePrefixHint
source: Prefix for invoice numbers (e.g. HTL-INV-)
th: คำนำหน้าสำหรับเลขที่ใบแจ้งหนี้ (เช่น HTL-INV-)

source: Default Invoice Notes
th: หมายเหตุใบแจ้งหนี้เริ่มต้น

# InvoiceNotesPlaceholder
source: Notes to appear on invoices by default...
th: หมายเหตุที่จะแสดงในใบแจ้งหนี้...

# PaymentInfo
source: Payment details for commission payouts to this agent.
th: ข้อมูลการชำระเงินสำหรับจ่ายคอมมิชชั่นให้ตัวแทนนี้

source: Bank Name
th: ชื่อธนาคาร

source: Select Bank
th: เลือกธนาคาร

# BankAccountNo
source: Account Number
th: เลขบัญชี

# BankAccountName
source: Account Name
th: ชื่อบัญชี

# AccountNamePlaceholder
source: Account holder name
th: ชื่อเจ้าของบัญชี

source: PromptPay ID
th: รหัสพร้อมเพย์

# PromptPayPlaceholder
source: Phone or ID number
th: เบอร์โทรหรือเลขบัตรประชาชน

# PromptPayHint
source: Phone number or national ID for PromptPay transfers
th: เบอร์โทรศัพท์หรือเลขบัตรประชาชนสำหรับโอนพร้อมเพย์

source: Cancel
th: ยกเลิก

source: Tour Guide
th: ไกด์นำเที่ยว

source: Hotel
th: โรงแรม

source: Travel Agency
th: บริษัททัวร์

source: Concierge
th: คอนเซียร์จ

source: Resort
th: รีสอร์ท

source: Transport Company
th: บริษัทขนส่ง

source: Other
th: อื่นๆ

source: Active
th: ใช้งาน

source: Inactive
th: ไม่ใช้งาน

source: Suspended
th: ระงับ
