Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Components/Shared/ExpectedArrivalsWidget.*.resx
Languages: th

source: Expected Arrivals
th: ลูกค้าที่คาดว่าจะมาถึง

source: View All
th: ดูทั้งหมด

source: No expected arrivals
th: ไม่มีลูกค้าที่คาดว่าจะมาถึง

source: Fully Paid
th: ชำระเต็มจำนวนแล้ว

source: Partially Paid
th: ชำระบางส่วน

source: Unpaid
th: ยังไม่ชำระ

source: vehicle
th: คัน

source: vehicles
th: คัน

source: Today
th: วันนี้

source: Tomorrow
th: พรุ่งนี้

source: Start Check-In
th: เริ่มเช็คอิน
