Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Components/Shared/InspectionSelector.*.resx
Languages: th

source: Inspector Type
th: ประเภทผู้ตรวจสอบ

source: Shop Staff
th: พนักงานร้าน

source: External Inspector
th: ผู้ตรวจสอบภายนอก

source: Select Staff Member
th: เลือกพนักงาน

source: Loading staff...
th: กำลังโหลดรายชื่อพนักงาน...

# SelectPlaceholder
source: -- Select --
th: -- เลือก --

source: Inspector Name
th: ชื่อผู้ตรวจสอบ

# InspectorNamePlaceholder
source: Enter inspector's full name
th: กรอกชื่อ-นามสกุลผู้ตรวจสอบ

# CompanyAffiliation
source: Company / Organization
th: บริษัท / องค์กร

# CompanyPlaceholder
source: e.g., ABC Hotel, Thai Insurance Co.
th: เช่น โรงแรม ABC, บริษัทประกันไทย

source: Inspection Notes
th: บันทึกการตรวจสอบ

# NotesPlaceholder
source: Any observations about vehicle condition...
th: ข้อสังเกตเกี่ยวกับสภาพยานพาหนะ...
