Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Vehicles/VehicleInspectionPage.*.resx
Languages: th

source: Vehicle Inspection
th: ตรวจสอบยานพาหนะ

source: Back
th: กลับ

source: Save
th: บันทึก

source: Vehicle Not Found
th: ไม่พบยานพาหนะ

# VehicleNotFoundDesc
source: The vehicle with ID {0} was not found.
th: ไม่พบยานพาหนะหมายเลข {0}

source: Back to Fleet
th: กลับไปรายการยานพาหนะ

source: 3D Inspection
th: ตรวจสอบ 3 มิติ

source: Accident Inspection
th: ตรวจสอบอุบัติเหตุ

source: Rental Inspection
th: ตรวจสอบการเช่า

source: Maintenance Inspection
th: ตรวจสอบการซ่อมบำรุง

source: Routine Inspection
th: ตรวจสอบประจำ

source: Existing Inspection
th: การตรวจสอบที่มีอยู่

source: Previous Inspections
th: การตรวจสอบก่อนหน้า

source: Date
th: วันที่

source: Type
th: ประเภท

source: Condition
th: สภาพ

source: Markers
th: ตำแหน่ง

source: Inspector
th: ผู้ตรวจสอบ

source: New
th: ใหม่

source: Damage Markers
th: ตำแหน่งความเสียหาย

source: Pre-existing
th: มีอยู่ก่อน

source: Estimated Total
th: ประมาณการรวม

source: Inspection Settings
th: การตั้งค่าการตรวจสอบ

source: Overall Condition
th: สภาพโดยรวม

source: Excellent
th: ดีเยี่ยม

source: Good
th: ดี

source: Fair
th: พอใช้

source: Poor
th: แย่

source: Damaged
th: เสียหาย

source: Notes
th: หมายเหตุ

# NotesPlaceholder
source: Enter any additional notes about the inspection...
th: กรอกหมายเหตุเพิ่มเติมเกี่ยวกับการตรวจสอบ...

# InspectionSaved
source: Inspection saved successfully
th: บันทึกการตรวจสอบสำเร็จ

# SaveFailed
source: Failed to save inspection: {0}
th: บันทึกการตรวจสอบล้มเหลว: {0}

# ErrorLoadingData
source: Error loading data: {0}
th: เกิดข้อผิดพลาดในการโหลดข้อมูล: {0}

# ErrorSaving
source: Error saving: {0}
th: เกิดข้อผิดพลาดในการบันทึก: {0}

source: Pre-Rental
th: ก่อนเช่า

source: Post-Rental
th: หลังเช่า

source: Accident
th: อุบัติเหตุ

source: Maintenance
th: ซ่อมบำรุง

source: Routine
th: ประจำ
