Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Vehicles/Vehicles.*.resx
Languages: th

source: Fleet Management
th: การจัดการฟลีทรถ

source: Vehicle Inventory
th: คลังยานพาหนะ

source: Add Vehicle
th: เพิ่มยานพาหนะ

source: Motorbike
th: รถจักรยานยนต์

source: Car
th: รถยนต์

source: Jet Ski
th: เจ็ทสกี

source: Boat
th: เรือ

source: Van
th: รถตู้

source: All
th: ทั้งหมด

# VehiclesCount
source: {0} Vehicles
th: ยานพาหนะ {0} คัน

source: Total Fleet
th: ฟลีททั้งหมด

source: Available
th: ว่าง

source: Ready to rent
th: พร้อมให้เช่า

source: Rented
th: ถูกเช่า

source: Currently out
th: กำลังใช้งานอยู่

source: Maintenance
th: ซ่อมบำรุง

source: Being serviced
th: กำลังรับบริการ

# SearchPlaceholder
source: Search by license plate, brand, model...
th: ค้นหาตามเลขทะเบียน, ยี่ห้อ, รุ่น...

source: All Status
th: ทุกสถานะ

source: All Brands
th: ทุกยี่ห้อ

source: Include Pooled
th: รวมรถในพูล

source: Table View
th: มุมมองตาราง

source: Card View
th: มุมมองการ์ด

source: Clear
th: ล้าง

source: Vehicle
th: ยานพาหนะ

source: Type
th: ประเภท

source: Pricing
th: ราคา

source: Status
th: สถานะ

source: Location
th: สถานที่

source: Actions
th: การจัดการ

source: No vehicles found
th: ไม่พบยานพาหนะ

# NoVehiclesFoundDescFilter
source: Try adjusting your search or filter criteria
th: ลองปรับการค้นหาหรือเงื่อนไขตัวกรองของคุณ

# NoVehiclesFoundDescEmpty
source: Get started by adding your first vehicle to the fleet
th: เริ่มโดยการเพิ่มยานพาหนะคันแรกของคุณลงในฟลีท

source: Interval pricing
th: ราคาตามช่วงเวลา

source: Pooled
th: อยู่ในพูล

source: Local
th: ในพื้นที่

source: Away
th: ไม่อยู่

source: Edit Details
th: แก้ไขรายละเอียด

source: Add to Pool
th: เพิ่มในพูล

source: Remove from Pool
th: นำออกจากพูล

source: Delete
th: ลบ

# ShowingVehicles
source: Showing {0} vehicles
th: แสดงยานพาหนะ {0} คัน

source: Reserved
th: จองแล้ว

source: Retired
th: เลิกใช้งาน

# ErrorLoadingData
source: Error loading data: {0}
th: เกิดข้อผิดพลาดในการโหลดข้อมูล: {0}

# AssignToPoolComingSoon
source: Assign {0} to pool - coming soon
th: กำหนด {0} เข้าพูล - เร็วๆ นี้

# MustBeAtHomeShop
source: Vehicle must be at home shop before removing from pool
th: ยานพาหนะต้องอยู่ที่สาขาหลักก่อนที่จะนำออกจากพูล

# RemovedFromPool
source: Vehicle removed from pool
th: นำยานพาหนะออกจากพูลเรียบร้อยแล้ว

# FailedToRemoveFromPool
source: Failed to remove from pool: {0}
th: ไม่สามารถนำออกจากพูลได้: {0}

# VehicleDeletedSuccess
source: Vehicle deleted successfully
th: ลบยานพาหนะเรียบร้อยแล้ว

# DeleteFailed
source: Delete failed: {0}
th: ลบไม่สำเร็จ: {0}
