Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Vehicles/VehicleDialog.*.resx
Languages: th

source: Vehicle Type
th: ประเภทของยานพาหนะ

source: License Plate
th: ทะเบียนรถ

source: Status
th: สถานะ

source: Brand
th: ยี่ห้อ

source: Model
th: รุ่น

source: Segment
th: เซ็กเมนต์

source: Select segment...
th: เลือกเซ็กเมนต์...

source: Transmission
th: ระบบเกียร์

source: Select...
th: เลือก...

source: Automatic
th: อัตโนมัติ

source: Manual
th: ธรรมดา (แมนนวล)

source: Engine CC
th: ขนาดเครื่องยนต์ (CC)

source: Engine (Liters)
th: ขนาดเครื่องยนต์ (ลิตร)

source: Passenger Capacity
th: ความจุผู้โดยสาร

source: Seat Count
th: จำนวนที่นั่ง

source: Color
th: สี

source: Year
th: ปี

source: Pricing
th: ราคา

# Rate15Min
source: 15 Minutes Rate (THB)
th: ราคา 15 นาที (บาท)

# Rate30Min
source: 30 Minutes Rate (THB)
th: ราคา 30 นาที (บาท)

# Rate1Hour
source: 1 Hour Rate (THB)
th: ราคา 1 ชั่วโมง (บาท)

# DailyRate
source: Daily Rate (THB)
th: ค่าเช่าต่อวัน (บาท)

# DepositAmount
source: Deposit Amount (THB)
th: เงินมัดจำ (บาท)

source: Driver / Guide Options
th: ตัวเลือกคนขับ / ไกด์

# DriverDailyFee
source: Driver Daily Fee (THB)
th: ค่าบริการคนขับต่อวัน (บาท)

# DriverFeeHint
source: Leave empty if driver not available
th: ปล่อยว่างไว้หากไม่มีคนขับ

# GuideDailyFee
source: Guide Daily Fee (THB)
th: ค่าบริการไกด์ต่อวัน (บาท)

# GuideFeeHint
source: Leave empty if guide not available
th: ปล่อยว่างไว้หากไม่มีไกด์

source: Maintenance Tracking
th: การติดตามการซ่อมบำรุง

# CurrentMileage
source: Current Mileage (km)
th: เลขไมล์ปัจจุบัน (กม.)

source: Last Service Date
th: วันที่รับบริการล่าสุด

source: Notes
th: บันทึก

# NotesPlaceholder
source: Additional notes about this vehicle...
th: บันทึกเพิ่มเติมเกี่ยวกับยานพาหนะนี้...

source: Third-Party Owner
th: เจ้าของบุคคลที่สาม

# IsThirdPartyOwned
source: This vehicle is owned by a third party
th: ยานพาหนะนี้เป็นของบุคคลที่สาม

# ThirdPartyHint
source: Enable to track owner payments when this vehicle is rented
th: เปิดใช้งานเพื่อติดตามการชำระเงินของเจ้าของเมื่อมีการเช่ายานพาหนะนี้

source: Owner
th: เจ้าของ

source: Select owner...
th: เลือกเจ้าของ...

source: No owners configured.
th: ยังไม่มีการตั้งค่าเจ้าของ

# AddOwnerFirst
source: Add an owner first
th: เพิ่มเจ้าของก่อน

source: Payment Model
th: รูปแบบการชำระเงิน

# DailyRateModel
source: Daily Rate
th: อัตราต่อวัน

# RevenueShareModel
source: Revenue Share (%)
th: ส่วนแบ่งรายได้ (%)

# OwnerDailyRate
source: Owner Daily Rate (THB)
th: อัตราต่อวันของเจ้าของ (บาท)

# OwnerDailyRateHint
source: Fixed amount paid to owner per rental day
th: จำนวนเงินคงที่ที่จ่ายให้เจ้าของต่อวันการเช่า

# RevenueSharePercent
source: Revenue Share (%)
th: ส่วนแบ่งรายได้ (%)

# RevenueShareHint
source: Percentage of gross rental rate paid to owner
th: เปอร์เซ็นต์ของค่าเช่ารวมที่จ่ายให้เจ้าของ

source: How it works:
th: หลักการทำงาน:

# DailyRateModelDesc
source: Owner receives a fixed payment per rental day, regardless of what the customer pays.
th: เจ้าของจะได้รับเงินคงที่ต่อวันการเช่า โดยไม่คำนึงว่าลูกค้าจะจ่ายเท่าใด

# RevenueShareModelDesc
source: Owner receives a percentage of the rental rate only (excludes insurance, accessories, and extras).
th: เจ้าของจะได้รับเปอร์เซ็นต์จากอัตราค่าเช่าเท่านั้น (ไม่รวมค่าประกัน อุปกรณ์เสริม และส่วนเสริมอื่นๆ)

source: Cancel
th: ยกเลิก

source: Save
th: บันทึก

# SaveFailed
source: Save failed: {0}
th: บันทึกไม่สำเร็จ: {0}

# Error
source: Error: {0}
th: ข้อผิดพลาด: {0}

source: Motorbike
th: รถจักรยานยนต์

source: Car
th: รถยนต์

source: Jet Ski
th: เจ็ทสกี

source: Boat
th: เรือ

source: Van
th: รถตู้

source: Vehicle
th: ยานพาหนะ

source: Small Sedan
th: รถยนต์ขนาดเล็ก

source: Big Sedan
th: รถยนต์ขนาดใหญ่

source: SUV
th: รถ SUV

source: Pickup
th: รถกระบะ

source: Hatchback
th: รถแฮทช์แบ็ก

source: Minivan
th: รถมินิแวน

source: Luxury
th: รถหรู

source: Available
th: ว่าง

source: Rented
th: ถูกเช่า

source: Maintenance
th: ซ่อมบำรุง

source: Reserved
th: จองแล้ว

source: Retired
th: เลิกใช้งาน
