Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Manager/CashDropVerificationDialog.*.resx
Languages: ms, th

source: Verify Cash Drops
ms: Sahkan Simpanan Tunai
th: ยืนยันเงินนำส่ง

source: Session Drops
ms: Simpanan Sesi
th: รายการนำส่งในกะ

source: Total Dropped
ms: Jumlah Disimpan
th: ยอดนำส่งทั้งหมด

# NoDropsRecorded
source: No cash drops recorded for this session
ms: Tiada simpanan tunai direkodkan untuk sesi ini
th: ไม่มีรายการนำส่งเงินในกะนี้

# CurrencyTypes
source: currencies
ms: mata wang
th: สกุลเงิน

source: Currency
ms: Mata Wang
th: สกุลเงิน

source: Dropped Amount
ms: Jumlah Disimpan
th: ยอดที่นำส่ง

source: Actual Count
ms: Kiraan Sebenar
th: ยอดจริง

source: Status
th: สถานะ

source: Matches
ms: Sepadan
th: ตรงกัน

source: Different
ms: Berbeza
th: ไม่ตรง

# EnterActualAmount
source: Enter actual safe count
ms: Masukkan kiraan sebenar dalam peti besi
th: ระบุยอดจริงในตู้เซฟ

# ReasonRequired
source: Reason is required when amounts differ
ms: Sebab diperlukan apabila jumlah berbeza
th: ต้องระบุเหตุผลเมื่อยอดไม่ตรง

# EnterReason
source: Enter reason for difference
ms: Masukkan sebab perbezaan
th: ระบุเหตุผลที่ยอดไม่ตรง

source: Variance
ms: Perbezaan
th: ส่วนต่าง

source: Over
ms: Lebihan
th: เกิน

source: Short
ms: Kekurangan
th: ขาด

source: Balanced
ms: Seimbang
th: ตรงกัน

source: Confirm Verification
ms: Sahkan Pengesahan
th: ยืนยันการตรวจสอบ

# VerificationComplete
source: Drop verification complete
ms: Pengesahan simpanan selesai
th: ยืนยันการนำส่งเงินเรียบร้อย

# VerificationFailed
source: Failed to verify drops
ms: Gagal mengesahkan simpanan
th: ไม่สามารถยืนยันการนำส่งได้

# LoadDataFailed
source: Failed to load drop data
ms: Gagal memuatkan data simpanan
th: ไม่สามารถโหลดข้อมูลการนำส่งได้

# DropTime
source: Time
ms: Masa
th: เวลา

# DropAmount
source: Amount
ms: Jumlah
th: จำนวน

source: Verify Safe Contents
ms: Sahkan Kandungan Peti Besi
th: ตรวจสอบเงินในตู้เซฟ

source: Reason
ms: Sebab
th: เหตุผล

source: Complete
ms: Lengkap
th: สมบูรณ์

source: Incomplete
ms: Tidak Lengkap
th: ไม่สมบูรณ์

source: Variance Detected
ms: Perbezaan Dikesan
th: พบส่วนต่าง

# TotalVarianceAmount
source: Total Variance
ms: Jumlah Perbezaan
th: ส่วนต่างรวม

# AllDropsMatch
source: All drops match safe contents
ms: Semua simpanan sepadan dengan kandungan peti besi
th: ยอดนำส่งทั้งหมดตรงกับเงินในตู้เซฟ
