Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Manager/DailyClose.*.resx
Languages: ms, th

# PageTitle
source: Daily Close
ms: Penutupan Harian
th: ปิดบัญชีประจำวัน

source: Daily Close Management
ms: Pengurusan Penutupan Harian
th: จัดการปิดบัญชีประจำวัน

source: Day Status
ms: Status Hari
th: สถานะวัน

# StatusOpen
source: Open
ms: Buka
th: เปิด

# StatusClosed
source: Closed
ms: Ditutup
th: ปิดแล้ว

# StatusReconciled
source: Reconciled
ms: Disesuaikan
th: กระทบยอดแล้ว

source: Close Day
ms: Tutup Hari
th: ปิดบัญชีวัน

source: Reopen Day
ms: Buka Semula Hari
th: เปิดบัญชีวันใหม่

# ClosedBy
source: Closed by: {0}
ms: Ditutup oleh: {0}
th: ปิดโดย: {0}

# ClosedAt
source: at {0}
ms: pada {0}
th: เมื่อ {0}

# ReopenedIndicator
source: Day was reopened
ms: Hari telah dibuka semula
th: วันนี้ถูกเปิดใหม่

# ReopenReason
source: Reason: {0}
ms: Sebab: {0}
th: เหตุผล: {0}

source: Total Cash In
ms: Jumlah Tunai Masuk
th: ยอดเงินสดรับ

source: Total Cash Out
ms: Jumlah Tunai Keluar
th: ยอดเงินสดจ่าย

source: Electronic Payments
ms: Pembayaran Elektronik
th: การชำระเงินอิเล็กทรอนิกส์

source: Dropped to Safe
ms: Dihantar ke Peti Besi
th: นำส่งตู้เซฟ

source: Total Sessions
ms: Jumlah Sesi
th: จำนวนกะทั้งหมด

source: Verified Sessions
ms: Sesi Disahkan
th: กะที่ตรวจสอบแล้ว

source: Sessions with Variance
ms: Sesi dengan Varians
th: กะที่มีส่วนต่าง

source: Total Variance
ms: Jumlah Varians
th: ส่วนต่างรวม

# UnresolvedVariances
source: Sessions with Unresolved Variance
ms: Sesi dengan Varians Belum Selesai
th: กะที่มีส่วนต่างยังไม่ได้แก้ไข

source: Staff
ms: Kakitangan
th: พนักงาน

source: Variance
ms: Varians
th: ส่วนต่าง

source: Post to Shortage
ms: Rekod Kekurangan
th: บันทึกขาดเงิน

source: View Details
ms: Lihat Butiran
th: ดูรายละเอียด

# NoUnresolvedVariances
source: All sessions have been resolved - no outstanding variances.
ms: Semua sesi telah diselesaikan - tiada varians tertunggak.
th: ทุกกะได้รับการแก้ไขแล้ว - ไม่มีส่วนต่างคงค้าง

source: Staff Shortages
ms: Kekurangan Kakitangan
th: รายการขาดเงินพนักงาน

source: Currency
ms: Mata Wang
th: สกุลเงิน

source: Amount
ms: Jumlah
th: จำนวนเงิน

# AmountInThb
source: THB Amount
ms: Jumlah THB
th: จำนวนเงิน (บาท)

source: Reason
ms: Sebab
th: เหตุผล

source: Logged By
ms: Direkod Oleh
th: บันทึกโดย

source: Logged At
ms: Direkod Pada
th: บันทึกเมื่อ

source: Generate Summary Report
ms: Jana Laporan Ringkasan
th: สร้างรายงานสรุป

source: Daily Summary Report
ms: Laporan Ringkasan Harian
th: รายงานสรุปประจำวัน

source: Session Details
ms: Butiran Sesi
th: รายละเอียดกะ

# ShortageLogged
source: Shortage logged successfully
ms: Kekurangan berjaya direkodkan
th: บันทึกขาดเงินสำเร็จ

# LoadDataFailed
source: Failed to load daily close data
ms: Gagal memuatkan data penutupan harian
th: ไม่สามารถโหลดข้อมูลปิดบัญชีประจำวันได้

# CloseDayConfirm
source: Close the day for {0}?
ms: Tutup hari untuk {0}?
th: ปิดบัญชีวันที่ {0}?

# UnverifiedVariancesWarning
source: Warning: {0} session(s) have unverified variances.
ms: Amaran: {0} sesi mempunyai varians yang belum disahkan.
th: คำเตือน: มี {0} กะที่ยังไม่ได้ตรวจสอบส่วนต่าง

# DayClosed
source: Day closed successfully
ms: Hari berjaya ditutup
th: ปิดบัญชีวันสำเร็จ

# CloseDayFailed
source: Failed to close day
ms: Gagal menutup hari
th: ไม่สามารถปิดบัญชีวันได้

# ReopenDayPrompt
source: Please provide a reason for reopening this day (minimum 10 characters):
ms: Sila berikan sebab untuk membuka semula hari ini (minimum 10 aksara):
th: กรุณาระบุเหตุผลในการเปิดวันใหม่ (อย่างน้อย 10 ตัวอักษร):

# ReasonTooShort
source: Reason must be at least 10 characters
ms: Sebab mesti sekurang-kurangnya 10 aksara
th: เหตุผลต้องมีอย่างน้อย 10 ตัวอักษร

# DayReopened
source: Day reopened successfully
ms: Hari berjaya dibuka semula
th: เปิดบัญชีวันใหม่สำเร็จ

# ReopenDayFailed
source: Failed to reopen day
ms: Gagal membuka semula hari
th: ไม่สามารถเปิดบัญชีวันใหม่ได้
