Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Manager/EndOfDay.*.resx
Languages: ms, th

# PageTitle
source: End of Day
ms: Akhir Hari
th: สรุปสิ้นวัน

source: End of Day Reconciliation
ms: Penyelesaian Akhir Hari
th: สรุปยอดสิ้นวัน

source: Total Cash In
ms: Jumlah Tunai Masuk
th: รับเงินสดรวม

source: Total Cash Out
ms: Jumlah Tunai Keluar
th: จ่ายเงินสดรวม

source: Electronic Payments
ms: Bayaran Elektronik
th: ชำระอิเล็กทรอนิกส์

source: Dropped to Safe
ms: Disimpan ke Peti Besi
th: นำส่งตู้เซฟ

source: Daily Cash Drops
ms: Simpanan Tunai Harian
th: สรุปเงินนำส่งประจำวัน

source: Payment Method Breakdown
ms: Pecahan Kaedah Bayaran
th: แยกตามช่องทางชำระ

source: Card Payments
ms: Bayaran Kad
th: บัตรเครดิต

source: Bank Transfers
ms: Pindahan Bank
th: โอนเงิน

source: PromptPay
th: พร้อมเพย์

source: Till Sessions
ms: Sesi Kaunter
th: กะพนักงาน

source: Staff
ms: Kakitangan
th: พนักงาน

source: Time
ms: Masa
th: เวลา

source: Float
ms: Wang Buka
th: เงินทอน

source: Cash In
ms: Tunai Masuk
th: รับเงิน

source: Cash Out
ms: Tunai Keluar
th: จ่ายเงิน

source: Expected
ms: Dijangka
th: ควรมี

source: Actual
ms: Sebenar
th: จริง

source: Variance
ms: Perbezaan
th: ส่วนต่าง

source: Status
th: สถานะ

source: Open
ms: Buka
th: เปิดอยู่

source: Verify All
ms: Sahkan Semua
th: ยืนยันทั้งหมด

source: Verify Drops
ms: Sahkan Simpanan
th: ยืนยันเงินนำส่ง

# DropsVerified
source: Drops verified successfully
ms: Simpanan berjaya disahkan
th: ยืนยันเงินนำส่งเรียบร้อย

source: Total Variance
ms: Jumlah Perbezaan
th: ส่วนต่างรวม

# AllSessionsBalanced
source: All sessions are balanced
ms: Semua sesi seimbang
th: ทุกกะลงตัว

# SessionsWithVariance
source: {0} session(s) with variance
ms: {0} sesi dengan perbezaan
th: {0} กะที่มีส่วนต่าง

# VerifiedCount
source: {0} / {1} verified
ms: {0} / {1} disahkan
th: ยืนยันแล้ว {0} / {1}

source: Session Details
ms: Butiran Sesi
th: รายละเอียดกะ

source: Verify Session
ms: Sahkan Sesi
th: ยืนยันกะ

# SessionVerified
source: Session verified successfully
ms: Sesi berjaya disahkan
th: ยืนยันกะเรียบร้อย

# AllSessionsAlreadyVerified
source: All sessions are already verified
ms: Semua sesi sudah disahkan
th: ยืนยันทุกกะแล้ว

# VerifyAllConfirmation
source: Verify all {0} unverified session(s)?
ms: Sahkan semua {0} sesi yang belum disahkan?
th: ยืนยันทั้ง {0} กะที่ยังไม่ยืนยัน?

source: Verify All Sessions
ms: Sahkan Semua Sesi
th: ยืนยันทุกกะ

# VerifiedSessionsCount
source: {0} session(s) verified
ms: {0} sesi disahkan
th: ยืนยันแล้ว {0} กะ

# NoDataAvailable
source: No data available for this date
ms: Tiada data untuk tarikh ini
th: ไม่มีข้อมูลสำหรับวันที่นี้

# LoadDataFailed
source: Failed to load data
ms: Gagal memuatkan data
th: โหลดข้อมูลไม่สำเร็จ

# StatusOpen
source: Open
ms: Buka
th: เปิดอยู่

# StatusReconciling
source: Reconciling
ms: Menyelesaikan
th: กำลังตรวจสอบ

# StatusClosed
source: Closed
ms: Ditutup
th: ปิดแล้ว

# StatusVariance
source: Variance
ms: Perbezaan
th: มีส่วนต่าง

# StatusPending
source: Pending
ms: Menunggu
th: รอยืนยัน

# StatusVerified
source: Verified
ms: Disahkan
th: ยืนยันแล้ว
