Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Manager/HandoverReportDialog.*.resx
Languages: ms

source: Sales Clearing Journal
ms: Jurnal Penjelasan Jualan

source: Shift Handover Report
ms: Laporan Serah Tugas Syif

source: Staff
ms: Kakitangan

# SessionDate
source: Date
ms: Tarikh

# OpenedAt
source: Opened
ms: Dibuka

# ClosedAt
source: Closed
ms: Ditutup

source: Description
ms: Penerangan

source: Credit
ms: Kredit

source: Opening Float
ms: Wang Buka

source: Cash Payment
ms: Bayaran Tunai

source: Card Payments
ms: Bayaran Kad

source: Bank Transfer
ms: Pindahan Bank

source: Float Top Up
ms: Tambah Wang

source: Cash Shortage
ms: Kekurangan Wang

source: Customer Refunds
ms: Bayaran Balik Pelanggan

source: Cash Drop to Safe
ms: Masuk Peti Keselamatan

source: Expenses
ms: Perbelanjaan

source: Change Given
ms: Baki Diberikan

source: Total
ms: Jumlah

source: Expected Balance
ms: Baki Dijangka

source: Actual Balance
ms: Baki Sebenar

source: Total Variance
ms: Jumlah Perbezaan

source: Verified by
ms: Disahkan oleh

# Print
source: Print / Download PDF
ms: Cetak / Muat Turun PDF
