Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Manager/Index.*.resx
Languages: th

# PageTitle
source: Dashboard - MotoRent Manager
th: แดชบอร์ด - ผู้จัดการ MotoRent

source: Dashboard
th: แดชบอร์ด

# DashboardSubtitle
source: Overview of your rental business performance
th: ภาพรวมผลการดำเนินงานธุรกิจเช่าของคุณ

source: Export Report
th: ส่งออกรายงาน

# TodayRevenue
source: Today's Revenue
th: รายได้วันนี้

source: Active Rentals
th: การเช่าที่ใช้งานอยู่

source: Returns Today
th: การคืนรถวันนี้

source: Fleet Utilization
th: อัตราการใช้งานรถ

# OverdueCount
source: {0} overdue
th: เกินกำหนด {0} รายการ

source: Revenue Trend
th: แนวโน้มรายได้

source: Fleet Status
th: สถานะรถในระบบ

source: Top Performing Bikes
th: รถที่ทำผลงานได้ดีที่สุด

source: Recent Activity
th: กิจกรรมล่าสุด

source: Alerts & Notifications
th: การแจ้งเตือน

# NoAlerts
source: No alerts at this time
th: ไม่มีการแจ้งเตือนในขณะนี้

# Days7
source: 7 Days
th: 7 วัน

# Days30
source: 30 Days
th: 30 วัน

# Days90
source: 90 Days
th: 90 วัน

source: View All
th: ดูทั้งหมด

source: Bike
th: รถ

# RentalsCount
source: Rentals
th: จำนวนการเช่า

source: Revenue
th: รายได้

source: Utilization
th: การใช้งาน

source: just now
th: เมื่อสักครู่

# MinAgo
source: {0} min ago
th: {0} นาทีที่แล้ว

# HrAgo
source: {0} hr ago
th: {0} ชม. ที่แล้ว

# DaysAgo
source: {0} days ago
th: {0} วันที่แล้ว

source: by
th: โดย

source: yesterday
th: เมื่อวาน

source: last week
th: สัปดาห์ที่แล้ว

source: Rented
th: ถูกเช่า

source: Available
th: ว่าง

source: Maintenance
th: ซ่อมบำรุง

source: Reserved
th: จองแล้ว
