Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Manager/ServiceTypes.*.resx
Languages: th

# PageTitle
source: Maintenance Service Types
th: ประเภทบริการซ่อมบำรุง

# Header
source: Service Types
th: ประเภทบริการ

# PreTitle
source: Maintenance Management
th: การจัดการซ่อมบำรุง

source: Create Defaults
th: สร้างค่าเริ่มต้น

source: Add Service Type
th: เพิ่มประเภทบริการ

source: No service types defined
th: ยังไม่ได้กำหนดประเภทบริการ

# NoServiceTypesDescription
source: Define standard maintenance services like Oil Change, Brake Service, or General Inspection.
th: กำหนดบริการมาตรฐาน เช่น เปลี่ยนน้ำมันเครื่อง, บริการเบรก หรือการตรวจสอบทั่วไป

source: Create Default Types
th: สร้างประเภทเริ่มต้น

source: Name
th: ชื่อ

source: Description
th: รายละเอียด

source: Days
th: จำนวนวัน

source: Kilometers
th: กิโลเมตร

source: Status
th: สถานะ

source: Order
th: ลำดับ

# DaysCount
source: {0} days
th: {0} วัน

# KmCount
source: {0} km
th: {0} กม.

# StatusActive
source: Active
th: เปิดใช้งาน

# StatusInactive
source: Inactive
th: ปิดใช้งาน

# ServiceTypeAdded
source: Service type added successfully
th: เพิ่มประเภทบริการสำเร็จแล้ว

source: Edit Service Type
th: แก้ไขประเภทบริการ

# ServiceTypeUpdated
source: Service type updated successfully
th: อัปเดตประเภทบริการสำเร็จแล้ว

# DeleteConfirmation
source: Delete {0}?
th: ลบ {0}?

# DeleteWarning
source: Are you sure you want to delete this service type? This may affect vehicles linked to it.
th: คุณแน่ใจหรือไม่ว่าต้องการลบประเภทบริการนี้? สิ่งนี้อาจส่งผลกระทบต่อรถที่เชื่อมโยงอยู่

# ServiceTypeDeleted
source: Service type deleted successfully
th: ลบประเภทบริการสำเร็จแล้ว

# DeleteFailed
source: Failed to delete service type: {0}
th: ไม่สามารถลบประเภทบริการ: {0}

# DefaultServiceTypesCreated
source: Default service types created successfully
th: สร้างประเภทบริการเริ่มต้นสำเร็จแล้ว

# CreateDefaultsFailed
source: Failed to create default types: {0}
th: ไม่สามารถสร้างประเภทเริ่มต้น: {0}
