Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Manager/ShortageLogDialog.*.resx
Languages: ms, th

# PostingShortage
source: Posting Staff Shortage
ms: Merekod Kekurangan Kakitangan
th: บันทึกขาดเงินพนักงาน

# ShortageExplanation
source: This will create a record of the cash shortage attributable to this staff member. The record is permanent and will appear in reports.
ms: Ini akan mencipta rekod kekurangan tunai yang dikaitkan dengan kakitangan ini. Rekod ini kekal dan akan muncul dalam laporan.
th: สิ่งนี้จะสร้างบันทึกของการขาดเงินสดที่เกิดจากพนักงานคนนี้ บันทึกนี้จะถาวรและจะปรากฏในรายงาน

source: Staff
ms: Kakitangan
th: พนักงาน

source: Session Variance
ms: Varians Sesi
th: ส่วนต่างของกะ

source: Select Currency
ms: Pilih Mata Wang
th: เลือกสกุลเงิน

source: Shortage Amount
ms: Jumlah Kekurangan
th: จำนวนเงินที่ขาด

# AmountWillBePositive
source: Amount will be stored as positive (shortage)
ms: Jumlah akan disimpan sebagai positif (kekurangan)
th: จำนวนเงินจะถูกบันทึกเป็นค่าบวก (ขาด)

# Reason
source: Reason / Explanation
ms: Sebab / Penjelasan
th: เหตุผล / คำอธิบาย

# ReasonPlaceholder
source: Enter the reason for this shortage...
ms: Masukkan sebab kekurangan ini...
th: ระบุเหตุผลสำหรับการขาดเงินนี้...

# ReasonTooShort
source: Reason must be at least 5 characters
ms: Sebab mesti sekurang-kurangnya 5 aksara
th: เหตุผลต้องมีอย่างน้อย 5 ตัวอักษร

source: Post Shortage
ms: Rekod Kekurangan
th: บันทึกขาดเงิน

# PostFailed
source: Failed to post shortage
ms: Gagal merekod kekurangan
th: ไม่สามารถบันทึกขาดเงินได้
