Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Manager/TillDashboard.*.resx
Languages: ms, th

# PageTitle
source: Till Dashboard
ms: Papan Pemuka Till
th: แดชบอร์ดลิ้นชัก

source: Till Dashboard
ms: Papan Pemuka Till
th: แดชบอร์ดลิ้นชัก

# DashboardSubtitle
source: Monitor active sessions and verify closed sessions
ms: Pantau sesi aktif dan sahkan sesi tertutup
th: ตรวจสอบเซสชันที่ใช้งานและยืนยันเซสชันที่ปิด

source: Refresh
ms: Muat Semula
th: รีเฟรช

source: Active Sessions
ms: Sesi Aktif
th: เซสชันที่ใช้งานอยู่

# NoActiveSessions
source: No active till sessions
ms: Tiada sesi till aktif
th: ไม่มีเซสชันลิ้นชักที่ใช้งานอยู่

source: Recent Closed Sessions
ms: Sesi Tertutup Baru-baru Ini
th: เซสชันที่ปิดล่าสุด

# NoClosedSessions
source: No closed sessions in this period
ms: Tiada sesi tertutup dalam tempoh ini
th: ไม่มีเซสชันที่ปิดในช่วงนี้

source: Today
ms: Hari Ini
th: วันนี้

source: Last 3 days
ms: 3 Hari Lalu
th: 3 วันล่าสุด

source: Last 7 days
ms: 7 Hari Lalu
th: 7 วันล่าสุด

source: Staff
ms: Kakitangan
th: พนักงาน

source: Closed At
ms: Ditutup Pada
th: ปิดเมื่อ

source: Duration
ms: Tempoh
th: ระยะเวลา

# TotalVariance
source: Variance (THB)
ms: Perbezaan (THB)
th: ส่วนต่าง (THB)

source: Status
th: สถานะ

source: View Details
ms: Lihat Butiran
th: ดูรายละเอียด

source: Verify
ms: Sahkan
th: ยืนยัน

source: Verify All
ms: Sahkan Semua
th: ยืนยันทั้งหมด

source: Handover Report
ms: Laporan Serah Tugas
th: รายงานส่งมอบ

source: Session Details
ms: Butiran Sesi
th: รายละเอียดเซสชัน

source: Verify Session
ms: Sahkan Sesi
th: ยืนยันเซสชัน

# VerifyConfirmation
source: Verify session for {0}?
ms: Sahkan sesi untuk {0}?
th: ยืนยันเซสชันของ {0}?

# VerifyAllConfirmation
source: Verify all {0} pending sessions?
ms: Sahkan semua {0} sesi yang tertunda?
th: ยืนยันเซสชันที่รอดำเนินการทั้งหมด {0} รายการ?

# SessionVerified
source: Session verified successfully
ms: Sesi berjaya disahkan
th: ยืนยันเซสชันสำเร็จ

# VerifyFailed
source: Failed to verify session
ms: Gagal mengesahkan sesi
th: ยืนยันเซสชันไม่สำเร็จ

# NoSessionsToVerify
source: No sessions available to verify
ms: Tiada sesi untuk disahkan
th: ไม่มีเซสชันที่จะยืนยัน

# VerifiedCount
source: {0} sessions verified
ms: {0} sesi disahkan
th: ยืนยัน {0} เซสชัน

# LoadFailed
source: Failed to load dashboard data
ms: Gagal memuatkan data papan pemuka
th: โหลดข้อมูลแดชบอร์ดไม่สำเร็จ

# StatusClosed
source: Closed
ms: Ditutup
th: ปิดแล้ว

# StatusVariance
source: Variance
ms: Perbezaan
th: มีส่วนต่าง

# StatusVerified
source: Verified
ms: Disahkan
th: ยืนยันแล้ว
