Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Tourist/MyBooking.*.resx
Languages: th

source: My Booking
th: การจองของฉัน

# ViewAndManageReservation
source: View and manage your reservation
th: ดูและจัดการการจองของคุณ

source: Browse Vehicles
th: เลือกดูรถ

source: Find Your Booking
th: ค้นหาการจองของคุณ

# EnterBookingReference
source: Enter your booking reference to view your reservation details
th: กรอกรหัสการจองเพื่อดูรายละเอียดการจอง

source: Booking Reference
th: รหัสการจอง

# SixCharacterCode
source: 6-character code from your confirmation
th: รหัส 6 ตัวอักษรจากการยืนยัน

source: Find My Booking
th: ค้นหาการจอง

# BookingNotFound
source: Booking not found. Please check your reference code and try again.
th: ไม่พบการจอง กรุณาตรวจสอบรหัสอ้างอิงและลองอีกครั้ง

source: Search Different Booking
th: ค้นหาการจองอื่น

source: Booking Details
th: รายละเอียดการจอง

source: Pickup Date
th: วันรับรถ

source: Return Date
th: วันคืนรถ

source: Duration
th: ระยะเวลา

source: days
th: วัน

source: Vehicles
th: ยานพาหนะ

source: vehicle
th: คัน

source: Reserved Vehicles
th: รถที่จอง

source: Color
th: สี

source: Contact Information
th: ข้อมูลติดต่อ

source: Name
th: ชื่อ

source: Phone
th: โทรศัพท์

source: Email
th: อีเมล

source: Hotel
th: โรงแรม

source: Payment Summary
th: สรุปการชำระเงิน

source: Total Amount
th: ยอดรวม

source: Deposit Required
th: มัดจำที่ต้องชำระ

source: Amount Paid
th: ยอดที่ชำระแล้ว

source: Balance Due
th: ยอดคงเหลือ

# PayBalanceAtPickup
source: Please pay the remaining balance at pickup.
th: กรุณาชำระยอดคงเหลือเมื่อรับรถ

source: Actions
th: การดำเนินการ

source: Cancel Booking
th: ยกเลิกการจอง

source: Pickup Location
th: สถานที่รับรถ

# ShowBookingRefToStaff
source: Show your booking reference ({0}) to staff
th: แสดงรหัสการจอง ({0}) ให้พนักงาน

source: Need Help?
th: ต้องการความช่วยเหลือ?

source: Call Us
th: โทรหาเรา

source: Line
th: ไลน์

source: Booking Pending
th: รอการยืนยัน

# BookingPendingDesc
source: Your booking is awaiting confirmation. You'll receive a notification once it's confirmed.
th: การจองของคุณรอการยืนยัน คุณจะได้รับการแจ้งเตือนเมื่อได้รับการยืนยัน

source: Booking Confirmed
th: ยืนยันการจองแล้ว

# BookingConfirmedDesc
source: Your booking is confirmed! Please arrive at the shop at your scheduled pickup time.
th: การจองของคุณได้รับการยืนยันแล้ว กรุณามาถึงร้านตามเวลานัดหมาย

source: Checked In
th: เช็คอินแล้ว

# CheckedInDesc
source: You're currently renting. Have a great ride!
th: คุณกำลังเช่ารถอยู่ ขับขี่ปลอดภัย!

source: Rental Completed
th: การเช่าเสร็จสิ้น

# RentalCompletedDesc
source: Thank you for renting with us! We hope to see you again.
th: ขอบคุณที่ใช้บริการ หวังว่าจะได้พบกันอีก!

source: Booking Cancelled
th: ยกเลิกการจองแล้ว

# BookingCancelledDesc
source: This booking has been cancelled.
th: การจองนี้ถูกยกเลิกแล้ว

# CancelConfirmation
source: Are you sure you want to cancel this booking? This action cannot be undone.
th: คุณแน่ใจหรือไม่ว่าต้องการยกเลิกการจองนี้? การดำเนินการนี้ไม่สามารถยกเลิกได้

# BookingCancelledSuccess
source: Booking cancelled successfully
th: ยกเลิกการจองเรียบร้อยแล้ว

# CancelError
source: An error occurred while cancelling. Please try again.
th: เกิดข้อผิดพลาดขณะยกเลิก กรุณาลองอีกครั้ง

# SearchError
source: An error occurred while searching. Please try again.
th: เกิดข้อผิดพลาดขณะค้นหา กรุณาลองอีกครั้ง
