Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/SuperAdmin/StartPage.*.resx
Languages: th

# PageTitle
source: Super Admin - MotoRent
th: ผู้ดูแลระบบสูงสุด - MotoRent

# BreadcrumbSuperAdmin
source: Super Admin
th: ผู้ดูแลระบบสูงสุด

# HeaderTitle
source: Super Admin Dashboard
th: แผงควบคุมผู้ดูแลระบบสูงสุด

# HeaderSubtitle
source: Manage organizations, users, and system configuration
th: จัดการองค์กร ผู้ใช้งาน และการตั้งค่าระบบ

# StatOrganizations
source: Organizations
th: องค์กร

# StatUsers
source: Users
th: ผู้ใช้งาน

# StatActiveInvites
source: Active Invites
th: คำเชิญที่ใช้งานอยู่

# StatRecentErrors
source: Recent Errors
th: ข้อผิดพลาดล่าสุด

# StatOpenTickets
source: Open Tickets
th: ตั๋วสนับสนุนที่เปิดอยู่

# CardOrganizationsTitle
source: Organizations
th: องค์กร

# CardOrganizationsText
source: View, create, and manage tenant organizations. Configure their settings and monitor their activity.
th: ดู สร้าง และจัดการองค์กรของลูกค้า ตั้งค่าคอนฟิกูเรชันและติดตามกิจกรรม

# CardOrganizationsFooter
source: Manage Organizations
th: จัดการองค์กร

# CardUsersTitle
source: Users
th: ผู้ใช้งาน

# CardUsersText
source: Manage system users and their account associations. Assign roles and configure permissions.
th: จัดการผู้ใช้งานระบบและความเกี่ยวข้องของบัญชี กำหนดบทบาทและสิทธิ์การใช้งาน

# CardUsersFooter
source: Manage Users
th: จัดการผู้ใช้งาน

# CardImpersonateTitle
source: Impersonate
th: สวมรอยเป็นผู้ใช้งาน

# CardImpersonateText
source: Sign in as any user to troubleshoot issues or test functionality from their perspective.
th: ลงชื่อเข้าใช้เป็นผู้ใช้งานคนใดก็ได้เพื่อแก้ไขปัญหาหรือทดสอบฟังก์ชันการทำงานจากมุมมองของพวกเขา

# CardImpersonateFooter
source: Impersonate User
th: สวมรอยเป็นผู้ใช้งาน

# CardInvitesTitle
source: Registration Invites
th: คำเชิญลงทะเบียน

# CardInvitesText
source: Create and manage invite codes for new organizations. Track usage and expiration dates.
th: สร้างและจัดการรหัสคำเชิญสำหรับองค์กรใหม่ ติดตามการใช้งานและวันหมดอายุ

# CardInvitesFooter
source: Manage Invites
th: จัดการคำเชิญ

# CardLogsTitle
source: System Logs
th: บันทึกระบบ

# CardLogsText
source: View application logs, error reports, and audit trails for debugging and monitoring.
th: ดูบันทึกการใช้งานแอปพลิเคชัน รายงานข้อผิดพลาด และประวัติการตรวจสอบเพื่อการดีบั๊กและติดตามผล

# CardLogsFooter
source: View Logs
th: ดูบันทึก

# CardSettingsTitle
source: System Settings
th: การตั้งค่าระบบ

# CardSettingsText
source: Configure global system settings, feature flags, and application-wide preferences.
th: ตั้งค่าระบบส่วนกลาง กำหนด Feature Flags และการตั้งค่าที่ส่งผลต่อทั้งแอปพลิเคชัน

# CardSettingsFooter
source: System Settings
th: การตั้งค่าระบบ

# CardSupportTitle
source: Support Requests
th: คำขอความช่วยเหลือ

# CardSupportText
source: View and manage customer support tickets from all tenants. Track response times and resolutions.
th: ดูและจัดการตั๋วสนับสนุนลูกค้าจากทุกองค์กร ติดตามเวลาตอบกลับและการแก้ไขปัญหา

# CardSupportFooter
source: Manage Support
th: จัดการการสนับสนุน

# CardVehiclesTitle
source: Vehicle Lookups
th: ข้อมูลรุ่นรถ

# CardVehiclesText
source: Manage global vehicle makes and models shared across all tenants.
th: จัดการยี่ห้อและรุ่นรถส่วนกลางที่ใช้งานร่วมกันทุกองค์กร

# CardVehiclesFooter
source: Manage Vehicles
th: จัดการรุ่นรถ

source: Quick Actions
th: ดำเนินการด่วน

# ActionNewOrg
source: New Organization
th: องค์กรใหม่

# ActionCreateInvite
source: Create Invite
th: สร้างคำเชิญ

# ActionViewErrors
source: View Errors
th: ดูข้อผิดพลาด

# ActionQuickImpersonate
source: Quick Impersonate
th: สวมรอยแบบด่วน
