Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/SuperAdmin/SuperAdminUserDialog.*.resx
Languages: th

# TabAddExisting
source: Add Existing User
th: เพิ่มผู้ใช้งานที่มีอยู่

source: Select User
th: เลือกผู้ใช้งาน

# SelectUserPlaceholder
source: Select a user to add...
th: เลือกผู้ใช้งานที่ต้องการเพิ่ม...

# NoAvailableUsers
source: No available users found
th: ไม่พบผู้ใช้งานที่สามารถเพิ่มได้

source: Select Roles
th: เลือกบทบาท

# RoleOrgAdmin
source: Organization Admin
th: ผู้ดูแลองค์กร

# RoleOrgAdminDesc
source: Full access to all settings and features
th: เข้าถึงการตั้งค่าและคุณสมบัติทั้งหมด

# RoleShopManager
source: Shop Manager
th: ผู้จัดการร้าน

# RoleShopManagerDesc
source: Daily operations and reports
th: การดำเนินงานรายวันและรายงาน

# RoleStaff
source: Staff
th: พนักงาน

# RoleStaffDesc
source: Rental desk operations
th: การดำเนินงานที่เคาน์เตอร์เช่า

# RoleMechanic
source: Mechanic
th: ช่างซ่อม

# RoleMechanicDesc
source: Maintenance and repairs
th: การบำรุงรักษาและการซ่อมแซม

# AtLeastOneRole
source: At least one role must be selected
th: ต้องเลือกอย่างน้อยหนึ่งบทบาท

# UserAlreadyInOrg
source: This user is already a member of this organization
th: ผู้ใช้งานนี้เป็นสมาชิกขององค์กรนี้อยู่แล้ว

# SelectUserRequired
source: Please select a user
th: กรุณาเลือกผู้ใช้งาน

source: User not found
th: ไม่พบผู้ใช้งาน

# UserAdded
source: {0} has been added to the organization
th: เพิ่ม {0} เข้าสู่องค์กรแล้ว

# SelectOrganization
source: Organization
th: องค์กร

# SelectOrgPlaceholder
source: Select an organization...
th: เลือกองค์กร...

# OrganizationRequired
source: Organization is required
th: จำเป็นต้องเลือกองค์กร
