Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/SuperAdmin/VehicleModelDialog.*.resx
Languages: th

source: Make / Brand
th: ยี่ห้อ / แบรนด์

# MakePlaceholder
source: e.g., Honda, Toyota, Yamaha
th: เช่น Honda, Toyota, Yamaha

source: Model Name
th: ชื่อรุ่น

# ModelPlaceholder
source: e.g., Click 125, PCX 160, Camry
th: เช่น Click 125, PCX 160, Camry

source: Vehicle Type
th: ประเภทรถ

source: Country of Origin
th: ประเทศที่ผลิต

source: Not specified
th: ไม่ได้ระบุ

# MotorbikeSpecs
source: Motorbike Specifications
th: ข้อมูลจำเพาะรถจักรยานยนต์

source: Engine CC
th: ขนาดเครื่องยนต์ (CC)

# EngineCCPlaceholder
source: e.g., 125, 150, 160
th: เช่น 125, 150, 160

# CarSpecs
source: Car Specifications
th: ข้อมูลจำเพาะรถยนต์

source: Segment
th: กลุ่มรถ (Segment)

source: Engine (Liters)
th: ขนาดเครื่องยนต์ (ลิตร)

# EngineLitersPlaceholder
source: e.g., 1.5, 2.0
th: เช่น 1.5, 2.0

source: Seat Count
th: จำนวนที่นั่ง

# SeatCountPlaceholder
source: e.g., 5, 7
th: เช่น 5, 7

# VanSpecs
source: Van Specifications
th: ข้อมูลจำเพาะรถตู้

# VanSeatCountPlaceholder
source: e.g., 12, 15
th: เช่น 12, 15

source: Production Years
th: ปีที่ผลิต

source: Year From
th: ตั้งแต่ปี

# YearFromPlaceholder
source: e.g., 2020
th: เช่น 2020

source: Year To
th: ถึงปี

# YearToPlaceholder
source: Leave empty if still in production
th: เว้นว่างไว้หากยังมีการผลิตอยู่

# SuggestedPricing
source: Suggested Pricing (THB)
th: ราคาแนะนำ (บาท)

source: Suggested Daily Rate
th: ราคาเช่าต่อวันแนะนำ

# DailyRatePlaceholder
source: e.g., 300, 500
th: เช่น 300, 500

source: Suggested Deposit
th: เงินมัดจำแนะนำ

# DepositPlaceholder
source: e.g., 2000, 5000
th: เช่น 2000, 5000

source: Recognition Settings
th: การตั้งค่าการจดจำ

# Aliases
source: Aliases (for Gemini matching)
th: ชื่อเรียกอื่น (สำหรับการจับคู่ Gemini)

# AliasesPlaceholder
source: Comma-separated alternative names, e.g., PCX, PCX160, PCX 160cc
th: ชื่อเรียกอื่น คั่นด้วยคอมม่า เช่น PCX, PCX160, PCX 160cc

# AliasesHint
source: Alternative names or spellings for this model to improve recognition accuracy
th: ชื่อเรียกอื่นหรือการสะกดแบบอื่นเพื่อให้การจดจำแม่นยำขึ้น

source: Display Order
th: ลำดับการแสดงผล

# DisplayOrderHint
source: Lower numbers appear first in lists (default: 100)
th: ตัวเลขน้อยจะแสดงก่อน (ค่าเริ่มต้น: 100)

source: Status
th: สถานะ

source: Active
th: ใช้งานอยู่

source: Inactive
th: ปิดใช้งาน

source: Cancel
th: ยกเลิก

source: Save Changes
th: บันทึกการเปลี่ยนแปลง

source: Create Model
th: สร้างรุ่นรถ

source: Saving...
th: กำลังบันทึก...

# MakeRequired
source: Make/Brand is required
th: จำเป็นต้องระบุยี่ห้อ/แบรนด์

# ModelRequired
source: Model name is required
th: จำเป็นต้องระบุชื่อรุ่น

# ErrorSaving
source: Error saving vehicle model: {0}
th: เกิดข้อผิดพลาดในการบันทึกรุ่นรถ: {0}

# FailedToSave
source: Failed to save vehicle model.
th: บันทึกรุ่นรถไม่สำเร็จ

# CountryJapan
source: Japan
th: ญี่ปุ่น

# CountryThailand
source: Thailand
th: ไทย

# CountryGermany
source: Germany
th: เยอรมนี

# CountrySouthKorea
source: South Korea
th: เกาหลีใต้

# CountryItaly
source: Italy
th: อิตาลี

# CountryUSA
source: USA
th: สหรัฐอเมริกา

# CountryChina
source: China
th: จีน
