Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/SuperAdmin/VehicleLookups.*.resx
Languages: th

# PageTitle
source: Vehicle Lookups - SafeNGo
th: ข้อมูลรุ่นรถ - SafeNGo

# Title
source: Vehicle Lookups
th: ข้อมูลรุ่นรถ

# Subtitle
source: Manage global vehicle makes and models (shared across all tenants)
th: จัดการยี่ห้อและรุ่นรถส่วนกลาง (ใช้งานร่วมกันทุกบริษัท)

source: Add Vehicle Model
th: เพิ่มรุ่นรถ

source: Search
th: ค้นหา

# SearchPlaceholder
source: Search make or model...
th: ค้นหายี่ห้อหรือรุ่น...

source: Vehicle Type
th: ประเภทรถ

source: All Types
th: ทุกประเภท

source: Make
th: ยี่ห้อ

source: All Makes
th: ทุกยี่ห้อ

source: Status
th: สถานะ

source: Active Only
th: เฉพาะที่ใช้งานอยู่

source: All
th: ทั้งหมด

# TableMake
source: Make
th: ยี่ห้อ

# TableModel
source: Model
th: รุ่น

# TableType
source: Type
th: ประเภท

# TableEngine
source: Engine
th: เครื่องยนต์

# TableYears
source: Years
th: ปีที่ผลิต

# TableStatus
source: Status
th: สถานะ

source: Active
th: ใช้งานอยู่

source: Inactive
th: ปิดใช้งาน

source: Edit
th: แก้ไข

source: Deactivate
th: ปิดใช้งาน

source: Activate
th: เปิดใช้งาน

# NoModelsFound
source: No vehicle models found
th: ไม่พบข้อมูลรุ่นรถ

# GetStartedSubtitle
source: Get started by adding popular Thai market vehicle models.
th: เริ่มต้นด้วยการเพิ่มรุ่นรถที่เป็นที่นิยมในตลาดไทย

# ShowingEntries
source: Showing {0} of {1} entries
th: แสดง {0} จากทั้งหมด {1} รายการ

# ErrorLoading
source: Error loading vehicle models: {0}
th: เกิดข้อผิดพลาดในการโหลดข้อมูลรุ่นรถ: {0}

# AddDialogTitle
source: Add Vehicle Model
th: เพิ่มรุ่นรถ

# CreatedSuccess
source: Vehicle model '{0}' created successfully.
th: สร้างรุ่นรถ '{0}' สำเร็จแล้ว

# EditDialogTitle
source: Edit {0}
th: แก้ไข {0}

# UpdatedSuccess
source: Vehicle model '{0}' updated successfully.
th: อัปเดตรุ่นรถ '{0}' สำเร็จแล้ว

# DeactivateConfirm
source: Are you sure you want to deactivate '{0}'? It will no longer appear in vehicle registration lookups.
th: คุณแน่ใจหรือไม่ว่าต้องการปิดใช้งาน '{0}'? รุ่นนี้จะไม่ปรากฏในการลงทะเบียนรถใหม่

# DeactivateTitle
source: Deactivate Vehicle Model
th: ปิดใช้งานรุ่นรถ

# DeactivatedSuccess
source: '{0}' has been deactivated.
th: '{0}' ถูกปิดใช้งานแล้ว

# DeactivateFailed
source: Failed to deactivate model.
th: ปิดใช้งานรุ่นรถไม่สำเร็จ

# ActivatedSuccess
source: '{0}' has been activated.
th: '{0}' ถูกเปิดใช้งานแล้ว

# ActivateFailed
source: Failed to activate model.
th: เปิดใช้งานรุ่นรถไม่สำเร็จ

source: present
th: ปัจจุบัน

source: Filters
th: ตัวกรอง

source: Vehicle Models
th: รุ่นรถ

source: models
th: รุ่น
