Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Components/Auth/ManagerPinDialog.*.resx
Languages: th

source: Manager Approval Required
th: ต้องการการอนุมัติจากผู้จัดการ

# EnterPinToApprove
source: Enter your 4-digit PIN to approve this action
th: ใส่รหัส PIN 4 หลักเพื่ออนุมัติ

# TooManyAttempts
source: Too many incorrect attempts
th: ใส่รหัสผิดเกินจำนวนครั้งที่กำหนด

source: seconds remaining
th: วินาทีที่เหลือ

source: Select Manager
th: เลือกผู้จัดการ

# NoManagerSelected
source: Please select a manager
th: กรุณาเลือกผู้จัดการ

source: Cancel
th: ยกเลิก

source: Approving as
th: อนุมัติในนาม

source: Loading managers...
th: กำลังโหลดรายชื่อผู้จัดการ...

# NoManagersWithPin
source: No managers with PIN configured. Please contact an administrator.
th: ไม่มีผู้จัดการที่ตั้งค่า PIN กรุณาติดต่อผู้ดูแลระบบ
