Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Maintenance/AddMaintenanceRecordDialog.*.resx
Languages: th

source: Loading service types...
th: กำลังโหลดประเภทบริการ...

source: Recording service for
th: บันทึกการบริการสำหรับ

source: Service Type
th: ประเภทบริการ

# SelectServiceType
source: -- Select a service type --
th: -- เลือกประเภทบริการ --

# NoServiceTypesConfigured
source: No service types configured. Please add service types first.
th: ยังไม่มีประเภทบริการ กรุณาเพิ่มประเภทบริการก่อน

source: Service Date
th: วันที่ให้บริการ

# MileageAtService
source: Mileage at Service (km)
th: ระยะทาง ณ วันบริการ (กม.)

# CurrentMileage
source: Current: {0} km
th: ปัจจุบัน: {0} กม.

source: Performed By
th: ผู้ดำเนินการ

# PerformedByPlaceholder
source: Mechanic name or shop
th: ชื่อช่างหรือร้าน

source: Notes
th: หมายเหตุ

# NotesPlaceholder
source: Any notes about the service...
th: หมายเหตุเกี่ยวกับการบริการ...

source: Cancel
th: ยกเลิก

source: Record Service
th: บันทึกการบริการ

# PleaseSelectServiceType
source: Please select a service type
th: กรุณาเลือกประเภทบริการ

source: Service recorded successfully
th: บันทึกการบริการเรียบร้อยแล้ว

# FailedToRecord
source: Failed to record: {0}
th: ไม่สามารถบันทึกได้: {0}

# Error
source: Error: {0}
th: ข้อผิดพลาด: {0}
