Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Maintenance/AddMaintenanceRecord.*.resx
Languages: th

source: Add Maintenance Record
th: เพิ่มบันทึกการบำรุงรักษา

source: Fleet
th: ยานพาหนะ

source: Back to Vehicle
th: กลับไปหน้ายานพาหนะ

source: Loading
th: กำลังโหลด

source: Vehicle not found
th: ไม่พบยานพาหนะ

source: Service Details
th: รายละเอียดการบริการ

source: Service Type
th: ประเภทบริการ

source: Loading service types
th: กำลังโหลดประเภทบริการ

# NoServiceTypesConfigured
source: No service types configured. Please add service types first.
th: ยังไม่มีประเภทบริการ กรุณาเพิ่มประเภทบริการก่อน

source: -- Select Service Type --
th: -- เลือกประเภทบริการ --

source: Service Date
th: วันที่ให้บริการ

source: Mileage at Service
th: ระยะทาง ณ วันบริการ

# CurrentMileage
source: Current: {0} km
th: ปัจจุบัน: {0} กม.

source: Cost
th: ค่าใช้จ่าย

source: Notes
th: หมายเหตุ

# NotesPlaceholder
source: Details about the service performed...
th: รายละเอียดเกี่ยวกับการบริการ...

# WorkshopInfo
source: Workshop Information
th: ข้อมูลศูนย์บริการ

# WorkshopName
source: Workshop/Garage Name
th: ชื่อศูนย์บริการ/อู่ซ่อม

# WorkshopNamePlaceholder
source: e.g., ABC Motorcycle Service
th: เช่น อู่ช่างแดง มอเตอร์ไซค์

source: Phone
th: โทรศัพท์

# PhonePlaceholder
source: e.g., 081-234-5678
th: เช่น 081-234-5678

source: Address
th: ที่อยู่

# AddressPlaceholder
source: Workshop address or location
th: ที่อยู่หรือตำแหน่งศูนย์บริการ

source: Cancel
th: ยกเลิก

source: Saving
th: กำลังบันทึก

source: Save Record
th: บันทึก

source: Photos
th: รูปภาพ

# PhotosHint
source: Upload photos of the work performed, parts replaced, or repairs done.
th: อัพโหลดรูปภาพงานที่ทำ ชิ้นส่วนที่เปลี่ยน หรือการซ่อมแซม

source: Upload Photo
th: อัพโหลดรูปภาพ

# DropOrClick
source: Drop or click to upload
th: ลากหรือคลิกเพื่ออัพโหลด

# MaxPhotosReached
source: Maximum photos reached
th: ถึงจำนวนรูปภาพสูงสุดแล้ว

source: Remove
th: ลบ

source: Documents
th: เอกสาร

# DocumentsHint
source: Attach receipts, invoices, or warranty documents.
th: แนบใบเสร็จ ใบแจ้งหนี้ หรือเอกสารรับประกัน

source: Document Type
th: ประเภทเอกสาร

source: Receipt
th: ใบเสร็จ

source: Invoice
th: ใบแจ้งหนี้

source: Warranty
th: เอกสารรับประกัน

source: Other
th: อื่นๆ

# MaxDocumentsReached
source: Maximum documents reached
th: ถึงจำนวนเอกสารสูงสุดแล้ว

# PleaseSelectServiceType
source: Please select a service type
th: กรุณาเลือกประเภทบริการ

# RecordSavedSuccessfully
source: Maintenance record saved successfully
th: บันทึกการบำรุงรักษาเรียบร้อยแล้ว

# SaveFailed
source: Failed to save record
th: ไม่สามารถบันทึกได้

source: Error
th: ข้อผิดพลาด
