Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Maintenance/MaintenanceAlerts.*.resx
Languages: th

source: Maintenance Alerts
th: การแจ้งเตือนการบำรุงรักษา

source: Automated Alerts
th: ระบบแจ้งเตือนอัตโนมัติ

source: Vehicle
th: ยานพาหนะ

source: Service
th: บริการ

source: Status
th: สถานะ

source: Triggered
th: แจ้งเตือนเมื่อ

source: Actions
th: การดำเนินการ

# NoAlertsFound
source: No maintenance alerts found.
th: ไม่พบรายการแจ้งเตือนการบำรุงรักษา

# AllClear
source: All clear! Your fleet is up to date.
th: เรียบร้อยดี! ยานพาหนะทั้งหมดได้รับการบำรุงรักษาตามกำหนด

source: Mark as Read
th: ทำเครื่องหมายว่าอ่านแล้ว

source: Resolve
th: ดำเนินการเรียบร้อย

source: Resolve Alert
th: จัดการการแจ้งเตือน

source: Resolution Notes
th: บันทึกการจัดการ

# ResolutionNotesPlaceholder
source: Enter notes about how this alert was resolved (e.g. service performed, dismissed as false positive)...
th: ระบุรายละเอียดการจัดการ (เช่น ดำเนินการเช็คระยะแล้ว, ปิดการแจ้งเตือนเนื่องจากข้อมูลผิดพลาด)...

source: Trigger Manual Check
th: สั่งตรวจสอบด้วยตนเอง

# AlertResolved
source: Alert resolved successfully.
th: จัดการการแจ้งเตือนเรียบร้อยแล้ว

# AlertMarkedRead
source: Alert marked as read.
th: ทำเครื่องหมายว่าอ่านแล้วเรียบร้อย

# ManualCheckTriggered
source: Manual maintenance check triggered. {0} new alerts created.
th: เริ่มการตรวจสอบด้วยตนเองแล้ว พบรายการใหม่ {0} รายการ
