Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/AccessoryDialog.*.resx
Languages: th

source: Accessory Name
th: ชื่ออุปกรณ์เสริม

# NamePlaceholder
source: e.g., Helmet, Phone Holder, Rain Poncho
th: เช่น หมวกกันน็อค, ที่ยึดโทรศัพท์, เสื้อกันฝน

# DailyRate
source: Daily Rate (THB)
th: ราคาต่อวัน (บาท)

source: Free with rental
th: ฟรีพร้อมการเช่า

source: Charge per day
th: คิดค่าบริการต่อวัน

source: Quantity Available
th: จำนวนที่มีอยู่

# IncludedFreeHint
source: This accessory is included free with every rental
th: อุปกรณ์เสริมนี้รวมอยู่ในการเช่าทุกครั้งโดยไม่มีค่าใช้จ่าย

source: Cancel
th: ยกเลิก

# SaveFailed
source: Save failed: {0}
th: บันทึกไม่สำเร็จ: {0}

# Error
source: Error: {0}
th: ข้อผิดพลาด: {0}
