Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Accessories.*.resx
Languages: th

source: Accessories
th: อุปกรณ์เสริม

source: Rental Accessories
th: อุปกรณ์เสริมสำหรับเช่า

source: Inventory Management
th: การจัดการคลังสินค้า

source: Add Accessory
th: เพิ่มอุปกรณ์เสริม

# SearchPlaceholder
source: Search by name...
th: ค้นหาตามชื่อ...

# TotalCount
source: Total: {0}
th: ทั้งหมด: {0}

# IncludedFreeCount
source: Free with rental: {0}
th: ฟรีพร้อมการเช่า: {0}

source: Name
th: ชื่อ

source: Daily Rate
th: ราคาต่อวัน

source: Quantity
th: จำนวน

source: Included
th: รวมอยู่ด้วย

source: Actions
th: การจัดการ

source: No accessories found
th: ไม่พบอุปกรณ์เสริม

source: Free
th: ฟรี

source: Out of stock
th: สินค้าหมด

source: Low
th: น้อย

source: Edit
th: แก้ไข

source: Delete
th: ลบ

# ShowingCount
source: Showing {0} accessories
th: แสดงอุปกรณ์เสริม {0} รายการ

# ErrorLoadingData
source: Error loading data: {0}
th: เกิดข้อผิดพลาดในการโหลดข้อมูล: {0}

# AccessoryAdded
source: Accessory added successfully
th: เพิ่มอุปกรณ์เสริมเรียบร้อยแล้ว

source: Edit Accessory
th: แก้ไขอุปกรณ์เสริม

# AccessoryUpdated
source: Accessory updated successfully
th: อัปเดตอุปกรณ์เสริมเรียบร้อยแล้ว

# DefaultAccessoryName
source: this accessory
th: อุปกรณ์เสริมนี้

# AccessoryDeleted
source: Accessory deleted successfully
th: ลบอุปกรณ์เสริมเรียบร้อยแล้ว

# DeleteFailed
source: Delete failed: {0}
th: ลบไม่สำเร็จ: {0}
