Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Deposits.*.resx
Languages: th

source: Deposits
th: เงินประกัน

source: Deposit Tracking
th: การติดตามเงินประกัน

source: Finance
th: การเงิน

# ManageDepositsHint
source: Manage security deposits for rentals
th: จัดการเงินประกันความเสียหายสำหรับการเช่า

source: Total Held
th: ยอดที่ถือไว้ทั้งหมด

source: Held
th: ถือไว้

source: Refunded
th: คืนแล้ว

source: Forfeited
th: ริบเงิน

source: All
th: ทั้งหมด

source: ID
th: ไอดี

source: Renter
th: ผู้เช่า

source: Motorbike
th: รถจักรยานยนต์

source: Type
th: ประเภท

source: Amount
th: จำนวนเงิน

source: Status
th: สถานะ

source: Collected
th: เก็บแล้ว

source: Actions
th: การจัดการ

source: No deposits found
th: ไม่พบข้อมูลเงินประกัน

source: Refund
th: คืนเงิน

source: Forfeit
th: ริบเงิน

source: View Rental
th: ดูการเช่า

# ErrorLoadingDeposits
source: Error loading deposits: {0}
th: เกิดข้อผิดพลาดในการโหลดข้อมูลเงินประกัน: {0}

source: Refund Deposit
th: คืนเงินประกัน

# DepositRefunded
source: Deposit refunded successfully
th: คืนเงินประกันเรียบร้อยแล้ว

# ConfirmForfeit
source: Forfeit Deposit
th: ยืนยันการริบเงินประกัน

# ConfirmForfeitMessage
source: Are you sure you want to forfeit the deposit of {0} from {1}? This action cannot be undone.
th: คุณแน่ใจหรือไม่ว่าต้องการริบเงินประกันจำนวน {0} จาก {1}? การดำเนินการนี้ไม่สามารถยกเลิกได้

source: Deposit forfeited
th: ริบเงินประกันเรียบร้อยแล้ว

# ForfeitFailed
source: Failed to forfeit deposit: {0}
th: ริบเงินประกันไม่สำเร็จ: {0}

# DepositsCount
source: {0} deposits
th: {0} รายการ
