Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/EditShop.*.resx
Languages: th

source: Edit Shop
th: แก้ไขร้านสาขา

source: Active
th: เปิดใช้งาน

source: Inactive
th: ปิดใช้งาน

source: Loading shop
th: กำลังโหลดข้อมูลร้านสาขา

source: Shop Not Found
th: ไม่พบร้านสาขา

# ShopNotFoundDescription
source: The shop you're looking for doesn't exist or has been deleted.
th: ร้านสาขาที่คุณกำลังค้นหาไม่มีอยู่หรือถูกลบไปแล้ว

source: Back to Shops
th: กลับไปหน้าร้านสาขา

source: Cancel
th: ยกเลิก

source: Saving
th: กำลังบันทึก

source: Save Changes
th: บันทึกการเปลี่ยนแปลง

# ErrorLoadingShop
source: Error loading shop: {0}
th: เกิดข้อผิดพลาดในการโหลดร้านสาขา: {0}

# ShopUpdatedSuccess
source: Shop updated successfully
th: อัปเดตร้านสาขาสำเร็จ

# SaveFailed
source: Failed to save shop
th: ไม่สามารถบันทึกร้านสาขาได้

source: Error
th: ข้อผิดพลาด
