Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/InsurancePackages.*.resx
Languages: th

source: Insurance Packages
th: แพ็กเกจประกันภัย

source: Settings
th: การตั้งค่า

source: Add Package
th: เพิ่มแพ็กเกจ

source: Status Overview:
th: ภาพรวมสถานะ:

# ActiveCount
source: Active: {0}
th: เปิดใช้งาน: {0}

# InactiveCount
source: Inactive: {0}
th: ปิดใช้งาน: {0}

source: Package Name
th: ชื่อแพ็กเกจ

source: Description
th: คำอธิบาย

source: Daily Rate
th: ราคาต่อวัน

source: Max Coverage
th: ความคุ้มครองสูงสุด

source: Deductible
th: ค่าเสียหายส่วนแรก

source: Status
th: สถานะ

source: Actions
th: การจัดการ

# NoInsurancesFound
source: No insurance packages found
th: ไม่พบแพ็กเกจประกันภัย

source: Edit
th: แก้ไข

source: Delete
th: ลบ

# ShowingCount
source: Showing {0} insurance packages
th: แสดงแพ็กเกจประกันภัย {0} รายการ

# ErrorLoadingData
source: Error loading data: {0}
th: เกิดข้อผิดพลาดในการโหลดข้อมูล: {0}

# InsuranceAdded
source: Insurance package added successfully
th: เพิ่มแพ็กเกจประกันภัยเรียบร้อยแล้ว

# EditInsurance
source: Edit Insurance Package
th: แก้ไขแพ็กเกจประกันภัย

# InsuranceUpdated
source: Insurance package updated successfully
th: อัปเดตแพ็กเกจประกันภัยเรียบร้อยแล้ว

# DefaultInsuranceName
source: this insurance package
th: แพ็กเกจประกันภัยนี้

# InsuranceDeleted
source: Insurance package deleted successfully
th: ลบแพ็กเกจประกันภัยเรียบร้อยแล้ว

# DeleteFailed
source: Delete failed: {0}
th: ลบไม่สำเร็จ: {0}

source: deactivated
th: ปิดใช้งานแล้ว

source: activated
th: เปิดใช้งานแล้ว

# InsuranceStatusUpdated
source: Insurance package {0}
th: แพ็กเกจประกันภัย{0}

# UpdateStatusFailed
source: Failed to update status: {0}
th: ปรับปรุงสถานะไม่สำเร็จ: {0}
