Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/RefundDepositDialog.*.resx
Languages: th

# RefundDepositHint
source: Refunding deposit of {0} to {1}
th: กำลังคืนเงินประกันจำนวน {0} ให้แก่ {1}

source: Refund Method
th: วิธีการคืนเงิน

source: Cash
th: เงินสด

# ReturnToCard
source: Return to Card (****{0})
th: คืนเข้าบัตร (****{0})

source: Bank Transfer
th: โอนเงินผ่านธนาคาร

# QRCode
source: QR Code (PromptPay)
th: คิวอาร์โค้ด (พร้อมเพย์)

# ConfirmRefundProcessed
source: I confirm the refund of {0} has been processed via {1}
th: ฉันยืนยันว่าได้ดำเนินการคืนเงินจำนวน {0} ผ่าน {1} เรียบร้อยแล้ว

source: Cancel
th: ยกเลิก

source: Process Refund
th: ดำเนินการคืนเงิน

# RefundFailed
source: Failed to process refund: {0}
th: การคืนเงินล้มเหลว: {0}

# Error
source: Error: {0}
th: ข้อผิดพลาด: {0}
