Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/RenterDialog.*.resx
Languages: th

source: Scan Documents
th: สแกนเอกสาร

source: Manual Entry
th: กรอกข้อมูลเอง

# ScanHint
source: Upload passport, ID card, or driving license to auto-fill the form.
th: อัปโหลดพาสปอร์ต, บัตรประชาชน หรือใบขับขี่เพื่อกรอกข้อมูลโดยอัตโนมัติ

# UploadedDocuments
source: Uploaded Documents ({0})
th: เอกสารที่อัปโหลดแล้ว ({0})

source: Personal Information
th: ข้อมูลส่วนตัว

source: Full Name
th: ชื่อ-นามสกุล

# FullNamePlaceholder
source: Full name as shown on passport
th: ชื่อ-นามสกุลตามที่ปรากฏในพาสปอร์ต

source: Nationality
th: สัญชาติ

# NationalityPlaceholder
source: e.g., USA, UK, Germany
th: เช่น ไทย, อเมริกัน, อังกฤษ

source: Identification
th: การยืนยันตัวตน

source: Passport Number
th: เลขที่พาสปอร์ต

source: National ID Number
th: เลขบัตรประจำตัวประชาชน

# ThaiNationalHint
source: For Thai nationals
th: สำหรับชาวไทย

source: Driving License Number
th: เลขที่ใบขับขี่

source: License Country
th: ประเทศที่ออกใบอนุญาต

source: License Expiry Date
th: วันหมดอายุใบขับขี่

source: Contact Information
th: ข้อมูลการติดต่อ

source: Phone Number
th: เบอร์โทรศัพท์

source: Email
th: อีเมล

source: Hotel Name
th: ชื่อโรงแรม

# HotelPlaceholder
source: Where are you staying?
th: คุณพักอยู่ที่ไหน?

source: Hotel Address
th: ที่อยู่โรงแรม

source: Emergency Contact
th: ติดต่อฉุกเฉิน

# EmergencyContactPlaceholder
source: Name and phone number
th: ชื่อและเบอร์โทรศัพท์

source: Cancel
th: ยกเลิก

# SaveFailed
source: Save failed: {0}
th: บันทึกไม่สำเร็จ: {0}

# Error
source: Error: {0}
th: ข้อผิดพลาด: {0}

# PassportDataApplied
source: Passport data applied to form
th: นำข้อมูลพาสปอร์ตมาใช้ในแบบฟอร์มแล้ว

# LicenseDataApplied
source: License data applied to form
th: นำข้อมูลใบขับขี่มาใช้ในแบบฟอร์มแล้ว

source: Passport
th: พาสปอร์ต

source: Driving License
th: ใบขับขี่
