Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Renters.*.resx
Languages: th

source: Renters
th: ผู้เช่า

source: Renter Management
th: การจัดการผู้เช่า

source: Customer Records
th: บันทึกข้อมูลลูกค้า

source: Register Renter
th: ลงทะเบียนผู้เช่า

# SearchPlaceholder
source: Search by name, phone, passport, email...
th: ค้นหาตามชื่อ, เบอร์โทรศัพท์, พาสปอร์ต, อีเมล...

source: Full Name
th: ชื่อ-นามสกุล

source: Nationality
th: สัญชาติ

source: Passport No.
th: เลขที่พาสปอร์ต

source: Phone
th: เบอร์โทรศัพท์

source: Email
th: อีเมล

source: Hotel
th: โรงแรม

source: Actions
th: การจัดการ

source: No renters found
th: ไม่พบข้อมูลผู้เช่า

source: Edit
th: แก้ไข

source: View Documents
th: ดูเอกสาร

source: Delete
th: ลบ

# ShowingCount
source: Showing {0} renters
th: แสดงผู้เช่า {0} รายการ

# ErrorLoadingData
source: Error loading data: {0}
th: เกิดข้อผิดพลาดในการโหลดข้อมูล: {0}

# RenterRegistered
source: Renter registered successfully
th: ลงทะเบียนผู้เช่าเรียบร้อยแล้ว

source: Edit Renter
th: แก้ไขผู้เช่า

# RenterUpdated
source: Renter updated successfully
th: อัปเดตข้อมูลผู้เช่าเรียบร้อยแล้ว

source: Document viewer coming soon
th: ระบบดูเอกสารจะพร้อมใช้งานเร็วๆ นี้

# CannotDeleteActiveRentals
source: Cannot delete: {0} has {1} active rental(s)
th: ไม่สามารถลบได้: {0} มีรายการเช่าที่ยังไม่เสร็จสิ้น {1} รายการ

# DefaultRenterName
source: this renter
th: ผู้เช่ารายนี้

# RenterDeleted
source: Renter deleted successfully
th: ลบข้อมูลผู้เช่าเรียบร้อยแล้ว

# DeleteFailed
source: Delete failed: {0}
th: ลบไม่สำเร็จ: {0}
