Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Shops.*.resx
Languages: th

source: Shops
th: ร้านสาขา

source: Shop Locations
th: ที่ตั้งร้านสาขา

source: Settings
th: การตั้งค่า

source: Add Shop
th: เพิ่มร้านสาขา

# SearchPlaceholder
source: Search by name, location, address...
th: ค้นหาตามชื่อ, สถานที่, ที่อยู่...

source: All Status
th: สถานะทั้งหมด

source: Active
th: เปิดใช้งาน

source: Inactive
th: ปิดใช้งาน

# ActiveCount
source: Active: {0}
th: เปิดใช้งาน: {0}

# InactiveCount
source: Inactive: {0}
th: ปิดใช้งาน: {0}

source: Edit
th: แก้ไข

source: Deactivate
th: ปิดใช้งาน

source: Activate
th: เปิดใช้งาน

source: Delete
th: ลบ

source: No shops found
th: ไม่พบร้านสาขา

# AddShopHint
source: Click "Add Shop" to create your first shop location.
th: คลิก "เพิ่มร้านสาขา" เพื่อสร้างร้านสาขาแรกของคุณ

# AdjustFiltersHint
source: Try adjusting your search filters.
th: ลองปรับเปลี่ยนตัวกรองการค้นหาของคุณ

# ErrorLoadingData
source: Error loading data: {0}
th: เกิดข้อผิดพลาดในการโหลดข้อมูล: {0}

# ShopAdded
source: Shop added successfully
th: เพิ่มร้านสาขาเรียบร้อยแล้ว

source: Edit Shop
th: แก้ไขร้านสาขา

# ShopUpdated
source: Shop updated successfully
th: อัปเดตร้านสาขาเรียบร้อยแล้ว

# ConfirmAction
source: Are you sure you want to {0} '{1}'?
th: คุณแน่ใจหรือไม่ว่าต้องการ{0} '{1}'?

# ConfirmTitle
source: Confirm {0}
th: ยืนยันการ{0}

# ActionSuccess
source: Shop {0}d successfully
th: {0}ร้านสาขาเรียบร้อยแล้ว

# ActionFailed
source: Failed to {0} shop: {1}
th: {0}ร้านสาขาไม่สำเร็จ: {1}

# DefaultShopName
source: this shop
th: ร้านสาขานี้

# ShopDeleted
source: Shop deleted successfully
th: ลบร้านสาขาเรียบร้อยแล้ว

# DeleteFailed
source: Delete failed: {0}
th: ลบไม่สำเร็จ: {0}
