Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Settings/DenominationGroupSettings.*.resx
Languages: ms, th

source: Denomination Groups
ms: Kumpulan Denominasi
th: กลุ่มชนิดธนบัตร

# ConfigureDenominationGroups
source: Configure denomination groups for exchange rates
ms: Konfigurasikan kumpulan denominasi untuk kadar pertukaran
th: กำหนดค่ากลุ่มชนิดธนบัตรสำหรับอัตราแลกเปลี่ยน

source: Add Group
ms: Tambah Kumpulan
th: เพิ่มกลุ่ม

source: Edit
th: แก้ไข

source: Delete
ms: Padam
th: ลบ

# NoGroupsForCurrency
source: No groups configured for this currency
ms: Tiada kumpulan dikonfigurasikan untuk mata wang ini
th: ไม่มีกลุ่มที่กำหนดค่าสำหรับสกุลเงินนี้

# NoGroupsConfigured
source: No Denomination Groups Configured
ms: Tiada Kumpulan Denominasi Dikonfigurasikan
th: ไม่มีกลุ่มชนิดธนบัตรที่กำหนดค่า

# NoGroupsHelpText
source: Create denomination groups to define different rate tiers for bill sizes
ms: Buat kumpulan denominasi untuk menentukan tahap kadar berbeza untuk saiz wang kertas
th: สร้างกลุ่มชนิดธนบัตรเพื่อกำหนดระดับอัตราที่แตกต่างกันสำหรับขนาดธนบัตร

source: Add First Group
ms: Tambah Kumpulan Pertama
th: เพิ่มกลุ่มแรก

# GroupSaved
source: Group saved successfully
ms: Kumpulan berjaya disimpan
th: บันทึกกลุ่มเรียบร้อยแล้ว

# SaveFailed
source: Failed to save group
ms: Gagal menyimpan kumpulan
th: ไม่สามารถบันทึกกลุ่มได้

# ConfirmDeleteTitle
source: Delete Group
ms: Padam Kumpulan
th: ลบกลุ่ม

# ConfirmDeleteMessage
source: Are you sure you want to delete the group "{0}"?
ms: Adakah anda pasti mahu memadamkan kumpulan "{0}"?
th: คุณแน่ใจหรือไม่ว่าต้องการลบกลุ่ม "{0}"?

# GroupDeleted
source: Group deleted successfully
ms: Kumpulan berjaya dipadamkan
th: ลบกลุ่มเรียบร้อยแล้ว

# DeleteFailed
source: Failed to delete group
ms: Gagal memadamkan kumpulan
th: ไม่สามารถลบกลุ่มได้
