Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Settings/DocumentTemplates.*.resx
Languages: th

# PageTitle
source: Document Templates
th: แม่แบบเอกสาร

# Header
source: Document Templates
th: แม่แบบเอกสาร

source: Seed Defaults
th: สร้างแม่แบบเริ่มต้น

source: New Template
th: สร้างแม่แบบใหม่

source: Name
th: ชื่อ

source: Shop
th: ร้าน

source: Status
th: สถานะ

source: Default
th: ค่าเริ่มต้น

source: Version
th: เวอร์ชัน

# NoTemplatesFound
source: No templates found for {0}
th: ไม่พบแม่แบบสำหรับ {0}

source: Set Default
th: ตั้งเป็นค่าเริ่มต้น

# SeedSuccess
source: Default templates seeded successfully
th: สร้างแม่แบบเริ่มต้นสำเร็จแล้ว

# SeedError
source: Error seeding templates: {0}
th: เกิดข้อผิดพลาดในการสร้างแม่แบบ: {0}

# LoadError
source: Error loading templates: {0}
th: เกิดข้อผิดพลาดในการโหลดแม่แบบ: {0}

# SetDefaultSuccess
source: {0} is now the default {1} template
th: {0} ถูกตั้งเป็นแม่แบบ {1} เริ่มต้นแล้ว

# SetDefaultError
source: Error setting default: {0}
th: เกิดข้อผิดพลาดในการตั้งค่าเริ่มต้น: {0}

source: Global
th: ทั่วไป

# ShopLabel
source: Shop {0}
th: ร้าน {0}
