Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Settings/DocumentTemplateDesigner.*.resx
Languages: th

# PageTitle
source: Document Template Designer
th: ตัวออกแบบแม่แบบเอกสาร

# Header
source: Template Designer
th: ตัวออกแบบแม่แบบ

source: Create New Template
th: สร้างแม่แบบใหม่

source: Edit Template
th: แก้ไขแม่แบบ

source: AI Suggester
th: ตัวช่วยแนะนำ AI

source: Preview
th: ตัวอย่าง

source: Save Template
th: บันทึกแม่แบบ

source: Template Info
th: ข้อมูลแม่แบบ

source: Name
th: ชื่อ

source: Document Type
th: ประเภทเอกสาร

source: Block Library
th: คลังบล็อก

# AiContextLabel
source: Context / Keywords
th: บริบท / คำสำคัญ

# AiContextPlaceholder
source: e.g. insurance, fuel policy...
th: เช่น ประกันภัย, นโยบายน้ำมัน...

source: Suggest Clauses
th: แนะนำข้อความ

source: Click to add
th: คลิกเพื่อเพิ่ม

# PreviewTitle
source: Live Preview (HTML)
th: ตัวอย่างสด (HTML)

# AiSuggestionFailed
source: AI Suggestion failed: {0}
th: AI แนะนำล้มเหลว: {0}

# ClauseAdded
source: Clause added to layout
th: เพิ่มข้อความในเค้าโครงแล้ว

# LoadError
source: Error loading template: {0}
th: เกิดข้อผิดพลาดในการโหลดแม่แบบ: {0}

# NameRequired
source: Template name is required
th: ต้องระบุชื่อแม่แบบ

# SaveSuccess
source: Template saved successfully
th: บันทึกแม่แบบสำเร็จแล้ว

# SaveError
source: Error saving template: {0}
th: เกิดข้อผิดพลาดในการบันทึกแม่แบบ: {0}

source: Heading
th: หัวข้อ

source: Text Block
th: บล็อกข้อความ

source: Data Table
th: ตารางข้อมูล

source: Image/Logo
th: รูปภาพ/โลโก้

source: Divider Line
th: เส้นคั่น

source: Signature
th: ลายเซ็น

source: Two Columns
th: สองคอลัมน์

source: Spacer
th: ตัวเว้นวรรค
