Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Settings/OrganizationSettings.*.resx
Languages: th

source: Organization Settings
th: ตั้งค่าองค์กร

source: Manage your organization
th: จัดการองค์กรของคุณ

# SettingsSaved
source: Settings saved successfully
th: บันทึกการตั้งค่าเรียบร้อยแล้ว

source: Profile
th: โปรไฟล์

source: Address
th: ที่อยู่

source: Rental Workflow
th: ขั้นตอนการเช่า

source: Notifications
th: การแจ้งเตือน

source: Payments
th: การชำระเงิน

source: Organization Profile
th: โปรไฟล์องค์กร

source: Organization Name
th: ชื่อองค์กร

# DisplayedInHeader
source: Displayed in the application header
th: แสดงในส่วนหัวของแอปพลิเคชัน

source: Logo
th: โลโก้

# UploadInBrandingSettings
source: Upload in Portal Branding settings
th: อัปโหลดในการตั้งค่าพอร์ทัล

source: Phone
th: โทรศัพท์

source: Email
th: อีเมล

source: Website
th: เว็บไซต์

# TaxId
source: Tax ID / VAT Number
th: เลขประจำตัวผู้เสียภาษี

source: Company Registration No.
th: เลขทะเบียนบริษัท

source: Default Currency
th: สกุลเงินเริ่มต้น

source: Timezone
th: โซนเวลา

source: Language
th: ภาษา

source: Headquarters Address
th: ที่อยู่สำนักงานใหญ่

# Street
source: Street Address
th: ที่อยู่

source: City
th: เมือง

# Province
source: Province / State
th: จังหวัด

source: Postal Code
th: รหัสไปรษณีย์

source: Country
th: ประเทศ

source: Rental Workflow Settings
th: ตั้งค่าขั้นตอนการเช่า

source: Check-In Process
th: ขั้นตอนเช็คอิน

source: Require Pre-Inspection
th: ต้องมีการตรวจสอบก่อน

# RequirePreInspectionDescription
source: Staff must complete vehicle inspection before rental
th: พนักงานต้องตรวจสอบรถก่อนเริ่มเช่า

source: Require Damage Photos
th: ต้องถ่ายรูปความเสียหาย

# RequireDamagePhotosDescription
source: Capture vehicle photos during check-in and check-out
th: ถ่ายรูปรถตอนเช็คอินและเช็คเอาท์

source: Require Deposit
th: ต้องมีเงินมัดจำ

# RequireDepositDescription
source: Collect deposit before rental begins
th: เก็บเงินมัดจำก่อนเริ่มเช่า

source: Require ID Verification
th: ต้องยืนยันตัวตน

# RequireIdVerificationDescription
source: Verify passport or license before rental
th: ยืนยันหนังสือเดินทางหรือใบขับขี่ก่อนเช่า

source: Default Values
th: ค่าเริ่มต้น

source: Default Rental Period
th: ระยะเวลาเช่าเริ่มต้น

source: days
th: วัน

source: Default Deposit Amount
th: เงินมัดจำเริ่มต้น

source: Online Portal
th: พอร์ทัลออนไลน์

# AllowOnlineReservation
source: Allow Online Reservations
th: อนุญาตจองออนไลน์

# AllowOnlineReservationDescription
source: Let tourists make reservations through the portal
th: ให้นักท่องเที่ยวจองผ่านพอร์ทัลได้

source: Notification Settings
th: ตั้งค่าการแจ้งเตือน

source: Email Notifications
th: การแจ้งเตือนทางอีเมล

source: Send Rental Confirmation
th: ส่งยืนยันการเช่า

# SendRentalConfirmationDescription
source: Email confirmation when rental is created
th: ส่งอีเมลยืนยันเมื่อสร้างการเช่า

source: Send Payment Receipt
th: ส่งใบเสร็จ

# SendPaymentReceiptDescription
source: Email receipt when payment is recorded
th: ส่งอีเมลใบเสร็จเมื่อบันทึกการชำระเงิน

source: Send Late Return Alert
th: แจ้งเตือนคืนช้า

# SendLateReturnAlertDescription
source: Notify when rental is overdue
th: แจ้งเตือนเมื่อการเช่าเกินกำหนด

source: Reminders
th: การเตือน

# ReminderDaysBeforeReturn
source: Return Reminder
th: เตือนก่อนคืนรถ

source: days before return
th: วันก่อนวันคืน

# ReminderDaysDescription
source: Set to 0 to disable return reminders
th: ตั้งค่าเป็น 0 เพื่อปิดการเตือนคืนรถ

source: Payment Settings
th: ตั้งค่าการชำระเงิน

source: Payment Methods
th: วิธีการชำระเงิน

source: Default Payment Method
th: วิธีชำระเงินเริ่มต้น

source: Accepted Payment Methods
th: วิธีชำระเงินที่รับ

source: Cash
th: เงินสด

source: Credit/Debit Card
th: บัตรเครดิต/เดบิต

source: Bank Transfer
th: โอนเงินผ่านธนาคาร

source: PromptPay ID
th: หมายเลข PromptPay

# PromptPayIdDescription
source: Phone number or Citizen ID for PromptPay
th: เบอร์โทรศัพท์หรือเลขบัตรประชาชนสำหรับ PromptPay

source: Bank Name
th: ชื่อธนาคาร

# BankAccountNo
source: Account Number
th: เลขบัญชี

# BankAccountName
source: Account Holder Name
th: ชื่อบัญชี
