Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Settings/ShopUsers.*.resx
Languages: ms

# Title
source: Team Members
ms: Ahli Pasukan

# PreTitle
source: Settings
ms: Tetapan

source: Add Team Member
ms: Tambah Ahli Pasukan

# SearchPlaceholder
source: Search by name or email...
ms: Cari mengikut nama atau emel...

source: All Roles
ms: Semua Peranan

source: All Status
ms: Semua Status

source: Active
ms: Aktif

source: Locked
ms: Dikunci

source: Username
ms: Nama Pengguna

source: Full Name
ms: Nama Penuh

source: Email
ms: Emel

source: Roles
ms: Peranan

source: Edit Roles
ms: Edit Peranan

source: Lock User
ms: Kunci Pengguna

source: Unlock User
ms: Buka Kunci Pengguna

# RemoveUser
source: Remove from Team
ms: Alih Keluar dari Pasukan

# NoUsersFound
source: No team members found
ms: Tiada ahli pasukan ditemui

# UserCount
source: {0} team members
ms: {0} ahli pasukan

source: Pending Invites
ms: Jemputan Tertangguh

# PendingInviteCount
source: {0} pending
ms: {0} tertangguh

source: Invited By
ms: Dijemput Oleh

# ExpiresAt
source: Expires
ms: Tamat Tempoh

source: Expired
ms: Tamat Tempoh

source: Cancel Invite
ms: Batal Jemputan

# InviteCancelled
source: Invitation cancelled
ms: Jemputan dibatalkan

# ConfirmCancelInvite
source: Cancel this invitation to {0}?
ms: Batalkan jemputan ini kepada {0}?

# ConfirmLock
source: Are you sure you want to lock {0}? They will not be able to log in.
ms: Adakah anda pasti mahu mengunci {0}? Mereka tidak akan dapat log masuk.

# ConfirmUnlock
source: Are you sure you want to unlock {0}?
ms: Adakah anda pasti mahu membuka kunci {0}?

# ConfirmRemove
source: Are you sure you want to remove {0} from this organization? They will lose access to all features.
ms: Adakah anda pasti mahu mengalih keluar {0} dari organisasi ini? Mereka akan kehilangan akses kepada semua ciri.

# UserLocked
source: {0} has been locked
ms: {0} telah dikunci

# UserUnlocked
source: {0} has been unlocked
ms: {0} telah dibuka kunci

# UserRemoved
source: {0} has been removed from the organization
ms: {0} telah dialih keluar dari organisasi

# RoleOrgAdmin
source: Organization Admin
ms: Pentadbir Organisasi

# RoleShopManager
source: Shop Manager
ms: Pengurus Kedai

# RoleStaff
source: Staff
ms: Kakitangan

# RoleMechanic
source: Mechanic
ms: Mekanik

# EditRolesFor
source: Edit Roles for {0}
ms: Edit Peranan untuk {0}

# RolesUpdated
source: Roles updated for {0}
ms: Peranan dikemas kini untuk {0}
