Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Settings/ShopUserDialog.*.resx
Languages: ms, th

# TabAddExisting
source: Add Existing User
ms: Tambah Pengguna Sedia Ada
th: เพิ่มผู้ใช้ที่มีอยู่

# TabInviteEmail
source: Invite by Email
ms: Jemput melalui Emel
th: เชิญทางอีเมล

source: Select User
ms: Pilih Pengguna
th: เลือกผู้ใช้

# SelectUserPlaceholder
source: Select a user to add...
ms: Pilih pengguna untuk ditambah...
th: เลือกผู้ใช้ที่จะเพิ่ม...

# NoAvailableUsers
source: All users are already members of this organization
ms: Semua pengguna sudah menjadi ahli organisasi ini
th: ผู้ใช้ทั้งหมดเป็นสมาชิกขององค์กรนี้แล้ว

source: Email
ms: Emel
th: อีเมล

# EmailPlaceholder
source: Enter email address
ms: Masukkan alamat emel
th: ป้อนที่อยู่อีเมล

# InviteNote
source: User will receive access when they log in with this email via Google or Microsoft
ms: Pengguna akan menerima akses apabila mereka log masuk dengan emel ini melalui Google atau Microsoft
th: ผู้ใช้จะได้รับสิทธิ์เข้าถึงเมื่อเข้าสู่ระบบด้วยอีเมลนี้ผ่าน Google หรือ Microsoft

source: Select Roles
ms: Pilih Peranan
th: เลือกบทบาท

# RoleOrgAdmin
source: Organization Admin
ms: Pentadbir Organisasi
th: ผู้ดูแลองค์กร

# RoleOrgAdminDesc
source: Full access to all settings and features
ms: Akses penuh kepada semua tetapan dan ciri
th: เข้าถึงการตั้งค่าและฟีเจอร์ทั้งหมด

# RoleShopManager
source: Shop Manager
ms: Pengurus Kedai
th: ผู้จัดการร้าน

# RoleShopManagerDesc
source: Daily operations and reports
ms: Operasi harian dan laporan
th: การดำเนินงานประจำวันและรายงาน

# RoleStaff
source: Staff
ms: Kakitangan
th: พนักงาน

# RoleStaffDesc
source: Rental desk operations
ms: Operasi kaunter sewaan
th: การดำเนินงานเคาน์เตอร์เช่า

# RoleMechanic
source: Mechanic
ms: Mekanik
th: ช่าง

# RoleMechanicDesc
source: Maintenance and repairs
ms: Penyelenggaraan dan pembaikan
th: การบำรุงรักษาและซ่อมแซม

# AtLeastOneRole
source: At least one role must be selected
ms: Sekurang-kurangnya satu peranan mesti dipilih
th: ต้องเลือกบทบาทอย่างน้อยหนึ่งบทบาท

# InvalidEmail
source: Please enter a valid email address
ms: Sila masukkan alamat emel yang sah
th: กรุณาป้อนที่อยู่อีเมลที่ถูกต้อง

# EmailRequired
source: Email address is required
ms: Alamat emel diperlukan
th: ต้องระบุที่อยู่อีเมล

# EmailAlreadyInvited
source: This email has already been invited
ms: Emel ini telah dijemput
th: อีเมลนี้ได้รับเชิญแล้ว

# UserAlreadyInOrg
source: This user is already a member of this organization
ms: Pengguna ini sudah menjadi ahli organisasi ini
th: ผู้ใช้นี้เป็นสมาชิกขององค์กรนี้แล้ว

# SelectUserRequired
source: Please select a user
ms: Sila pilih pengguna
th: กรุณาเลือกผู้ใช้

source: User not found
ms: Pengguna tidak ditemui
th: ไม่พบผู้ใช้

# UserAdded
source: {0} has been added to the team
ms: {0} telah ditambah ke pasukan
th: {0} ถูกเพิ่มเข้าทีมแล้ว

# InviteSent
source: Invitation sent to {0}
ms: Jemputan dihantar kepada {0}
th: ส่งคำเชิญไปยัง {0} แล้ว

# RolesUpdated
source: Roles updated for {0}
ms: Peranan dikemas kini untuk {0}
th: อัปเดตบทบาทสำหรับ {0} แล้ว

# CannotRemoveOwnOrgAdmin
source: You cannot remove your own Organization Admin role
ms: Anda tidak boleh mengalih keluar peranan Pentadbir Organisasi anda sendiri
th: คุณไม่สามารถลบบทบาทผู้ดูแลองค์กรของตัวเองได้

# TabCreateNew
source: Create New User
th: สร้างผู้ใช้ใหม่

# Provider
source: Login Provider
th: ผู้ให้บริการล็อกอิน

# ProviderHint
source: Select the authentication provider the user will use to sign in
th: เลือกผู้ให้บริการยืนยันตัวตนที่ผู้ใช้จะใช้ในการเข้าสู่ระบบ

# Username
source: Username / Email
th: ชื่อผู้ใช้ / อีเมล

# UsernameRequired
source: Username is required
th: ต้องระบุชื่อผู้ใช้

source: Full Name
th: ชื่อเต็ม

# FullNamePlaceholder
source: Enter full name
th: ป้อนชื่อเต็ม

# FullNameRequired
source: Full name is required
th: ต้องระบุชื่อเต็ม

# UserCreated
source: {0} has been created and added to the team
th: สร้าง {0} และเพิ่มเข้าทีมแล้ว

# UserExistsContactAdmin
source: A user with this email already exists. Contact Super Admin to add them to your organization.
th: มีผู้ใช้อีเมลนี้อยู่แล้ว กรุณาติดต่อ Super Admin เพื่อเพิ่มเข้าองค์กรของคุณ
