Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Staff/TillCloseSessionDialog.*.resx
Languages: ms, th

source: Opening
ms: Pembukaan
th: เปิด

source: Cash In
ms: Tunai Masuk
th: เงินสดเข้า

source: Cash Out
ms: Tunai Keluar
th: เงินสดออก

source: Expected Cash
ms: Tunai Dijangka
th: เงินสดที่ควรมี

source: Actual Cash Count
ms: Kiraan Tunai Sebenar
th: ยอดเงินสดจริง

source: Balanced
ms: Seimbang
th: สมดุล

source: Over
ms: Lebih
th: เกิน

source: Short
ms: Kurang
th: ขาด

# OverMessage
source: Your till has more cash than expected
ms: Laci tunai anda mempunyai lebih wang daripada dijangka
th: ลิ้นชักมีเงินสดมากกว่าที่คาดไว้

# ShortMessage
source: Your till is short by this amount
ms: Laci tunai anda kurang jumlah ini
th: ลิ้นชักขาดเงินตามจำนวนนี้

# AcknowledgeVariance
source: I acknowledge this variance and confirm the cash count is correct
ms: Saya mengakui perbezaan ini dan mengesahkan kiraan tunai adalah betul
th: ฉันรับทราบความแตกต่างนี้และยืนยันว่าจำนวนเงินถูกต้อง

source: Closing Notes
ms: Nota Penutupan
th: หมายเหตุปิดกะ

# ClosingNotesPlaceholder
source: Any notes about closing the till...
ms: Sebarang nota tentang penutupan laci tunai...
th: หมายเหตุเกี่ยวกับการปิดลิ้นชัก...

source: Cancel
ms: Batal
th: ยกเลิก

source: Close Session
ms: Tutup Sesi
th: ปิดเซสชัน

source: Manager Force Close
ms: Penutupan Paksa Pengurus
th: ผู้จัดการปิดบังคับ

source: Manager Approval
ms: Kelulusan Pengurus
th: อนุมัติโดยผู้จัดการ

source: Closing Summary
ms: Ringkasan Penutupan
th: สรุปการปิดรอบ

source: Currency
ms: Mata Wang
th: สกุลเงิน

source: Expected
ms: Dijangka
th: คาดหวัง

source: Counted
ms: Dikira
th: นับได้

source: Variance
ms: Perbezaan
th: ส่วนต่าง

source: Overall Variance (THB)
ms: Perbezaan Keseluruhan (THB)
th: ส่วนต่างรวม (บาท)

source: Review Summary
ms: Semak Ringkasan
th: ตรวจสอบสรุป

source: Back to Count
ms: Kembali ke Kiraan
th: กลับไปนับ

source: Close Your Shift
ms: Tutup Syif Anda
th: ปิดกะของคุณ

# CountCashAndCloseSession
source: Count your cash and close your till session
ms: Kira tunai anda dan tutup sesi laci tunai
th: นับเงินสดและปิดเซสชันลิ้นชัก

source: Till
ms: Laci Tunai
th: ลิ้นชัก

source: Started
ms: Bermula
th: เริ่มเมื่อ

source: Total Counted
ms: Jumlah Dikira
th: ยอดรวมที่นับได้

source: Review Your Count
ms: Semak Kiraan Anda
th: ตรวจสอบยอดที่นับ

source: Closing Notes (Optional)
ms: Nota Penutupan (Pilihan)
th: หมายเหตุปิดกะ (ไม่บังคับ)
