Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Staff/TillOpenSessionDialog.*.resx
Languages: th

# EnterOpeningFloatDescription
source: Enter the amount of cash currently in your drawer to start your shift.
th: กรอกจำนวนเงินสดที่มีในลิ้นชักเพื่อเริ่มกะการทำงาน

source: Opening Float
th: เงินสดเปิดกะ

# CountAllCashHint
source: Count all cash in your drawer before starting
th: นับเงินสดทั้งหมดในลิ้นชักก่อนเริ่ม

source: Notes (optional)
th: หมายเหตุ (ไม่บังคับ)

# NotesPlaceholder
source: Any notes about opening the till...
th: หมายเหตุเกี่ยวกับการเปิดลิ้นชัก...

source: Cancel
th: ยกเลิก

source: Open Session
th: เปิดเซสชัน

source: Select Shop
th: เลือกร้าน

# ChooseShop
source: -- Choose a shop --
th: -- เลือกร้าน --

# ThbRequiredError
source: Please enter Thai Baht denominations. At least one denomination count is required.
th: กรุณาใส่จำนวนธนบัตรบาทไทย ต้องระบุอย่างน้อยหนึ่งธนบัตร
