Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Staff/Till.*.resx
Languages: th

source: Cashier Till
th: ลิ้นชักเงินสด

source: Start Your Shift
th: เริ่มกะการทำงาน

# OpenNewTillSessionDescription
source: Open a new till session to start recording transactions
th: เปิดเซสชันลิ้นชักเงินสดเพื่อเริ่มบันทึกธุรกรรม

source: Open Till Session
th: เปิดลิ้นชักเงินสด

source: OPEN
th: เปิด

source: Started
th: เริ่ม

source: Opening Float
th: เงินสดเปิดกะ

source: Cash In
th: เงินสดเข้า

source: Cash Out
th: เงินสดออก

source: Expected Cash in Till
th: เงินสดที่ควรมี

# DroppedToSafe
source: {0} dropped to safe
th: นำส่งตู้เซฟ {0}

source: Non-Cash Payments
th: การชำระแบบไม่ใช้เงินสด

source: Card
th: บัตร

source: Bank Transfer
th: โอนเงิน

source: PromptPay
th: พร้อมเพย์

source: Quick Payments
th: รับชำระเงิน

source: Rental Payment
th: ค่าเช่า

source: Deposit
th: ค่ามัดจำ

source: Booking Deposit
th: มัดจำจอง

# PaymentRecorded
source: Payment recorded successfully
th: บันทึกการชำระเรียบร้อย

# DepositRecorded
source: Deposit recorded successfully
th: บันทึกค่ามัดจำเรียบร้อย

source: Quick Payouts
th: จ่ายเงินด่วน

source: Fuel
th: น้ำมัน

source: Agent
th: ตัวแทน

source: Petty Cash
th: เงินสดย่อย

source: Till Operations
th: การดำเนินการลิ้นชัก

source: Cash Drop
th: นำส่งเงิน

source: Top Up
th: เติมเงิน

source: Close Shift
th: ปิดกะ

source: Recent Transactions
th: ธุรกรรมล่าสุด

source: View All
th: ดูทั้งหมด

source: No transactions yet
th: ยังไม่มีธุรกรรม

# ManageYourCashDrawer
source: Manage your cash drawer and transactions
th: จัดการลิ้นชักเงินสดและธุรกรรมของคุณ

source: Session Active
th: เซสชันกำลังทำงาน

# TransactionsWillAppearHere
source: Transactions will appear here as they are recorded
th: ธุรกรรมจะแสดงที่นี่เมื่อมีการบันทึก

source: Session Receipts
th: ใบเสร็จประจำกะ

source: Receipt
th: ใบเสร็จ

source: New Transaction
th: รายการใหม่

# TxnCheckIn
source: Check-In
th: เช็คอิน

# TxnOverpaymentRefund
source: Overpayment Refund
th: คืนเงินจ่ายเกิน

# TxnVoidReversal
source: Void Reversal
th: กลับรายการยกเลิก

source: Void Transaction
th: ยกเลิกรายการ

source: View Void Details
th: ดูรายละเอียดการยกเลิก

source: Manager Approval
th: การอนุมัติจากผู้จัดการ

# TransactionVoided
source: Transaction voided successfully
th: ยกเลิกรายการสำเร็จ

# VoidFailed
source: Failed to void transaction
th: ไม่สามารถยกเลิกรายการได้

source: Voided by
th: ยกเลิกโดย

source: Approved by
th: อนุมัติโดย

source: Reason
th: เหตุผล

source: Voided at
th: ยกเลิกเมื่อ

source: Overpayment Refund
th: คืนเงินจ่ายเกิน

# RefundRecorded
source: Refund of {0} recorded successfully
th: บันทึกการคืนเงิน {0} สำเร็จ

# RefundFailed
source: Failed to record refund
th: ไม่สามารถบันทึกการคืนเงินได้

# SessionNotOpen
source: Session is not open
th: เซสชันยังไม่เปิด

# StaleSessionTitle
source: Previous Session Open
th: เซสชันก่อนหน้ายังเปิดอยู่

# StaleSessionWarning
source: This till session is from {0}. You must close it before starting a new shift.
th: เซสชันแคชเชียร์นี้มาจากวันที่ {0} คุณต้องปิดก่อนเริ่มกะใหม่

# StaleSessionClosePrompt
source: Please count your cash and close this session
th: กรุณานับเงินสดและปิดเซสชันนี้

# LateClosureNote
source: This session will be flagged for manager review due to late closure
th: เซสชันนี้จะถูกส่งให้ผู้จัดการตรวจสอบเนื่องจากปิดล่าช้า

# SessionStale
source: Stale
th: ค้างอยู่

source: Staff Name
th: ชื่อพนักงาน

source: Opened On
th: เปิดเมื่อ

# CloseShiftToStartNew
source: Close this session to start a new shift for today
th: ปิดเซสชันนี้เพื่อเริ่มกะใหม่สำหรับวันนี้

source: Till
th: ลิ้นชัก
