Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Staff/TillReceiveDepositDialog.*.resx
Languages: th

source: Search Rental
th: ค้นหาการเช่า

# RentalIdPlaceholder
source: Rental ID or customer name
th: เลขที่เช่าหรือชื่อลูกค้า

source: Amount
th: จำนวนเงิน

source: Deposit Type
th: ประเภทมัดจำ

source: Cash
th: เงินสด

# CardPreAuth
source: Card Pre-authorization
th: พรีออธ (บัตร)

# CardLast4
source: Card Last 4 Digits
th: 4 หลักท้ายบัตร

# TransactionRef
source: Transaction Reference
th: เลขอ้างอิงธุรกรรม

# TransactionRefPlaceholder
source: Terminal reference number
th: หมายเลขอ้างอิงจากเครื่องรูดบัตร

source: Notes
th: หมายเหตุ

# NotesPlaceholder
source: Additional notes (optional)
th: หมายเหตุเพิ่มเติม (ไม่บังคับ)

source: Cancel
th: ยกเลิก

source: Record Deposit
th: บันทึกค่ามัดจำ

# NoActiveRentalsFound
source: No active rentals found. Please try a different search term.
th: ไม่พบการเช่าที่ใช้งานอยู่ กรุณาลองค้นหาด้วยคำอื่น

# FailedToRecordDeposit
source: Failed to record deposit. Please try again.
th: ไม่สามารถบันทึกค่ามัดจำได้ กรุณาลองอีกครั้ง
