Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Staff/TillTransactionDialog.*.resx
Languages: th

source: Search Transaction
th: ค้นหารายการ

# SearchHint
source: Booking ref, customer name, or phone
th: รหัสจอง ชื่อลูกค้า หรือเบอร์โทร

# SearchHintDetail
source: Enter booking reference (e.g., ABC123), customer name, or phone number
th: ใส่รหัสจอง (เช่น ABC123) ชื่อลูกค้า หรือเบอร์โทรศัพท์

source: Loading...
th: กำลังโหลด...

# NoResultsFound
source: No bookings or rentals found. Please check your search term.
th: ไม่พบการจองหรือการเช่า กรุณาตรวจสอบคำค้นหา

source: Bookings
th: การจอง

source: Active Rentals
th: การเช่าที่ใช้งานอยู่

source: Due
th: ค้างชำระ

source: Fully Paid
th: ชำระครบแล้ว

source: Active
th: ใช้งานอยู่

source: Booking Deposit
th: มัดจำการจอง

source: Check-In
th: เช็คอิน

source: Check-Out
th: เช็คเอาท์

source: Recent transactions
th: รายการล่าสุด

# SearchToStart
source: Search for a booking or rental to start a transaction.
th: ค้นหาการจองหรือการเช่าเพื่อเริ่มรายการ

# SelectToStart
source: Select a booking or rental to proceed
th: เลือกการจองหรือการเช่าเพื่อดำเนินการต่อ

source: Cancel
th: ยกเลิก

source: Customer
th: ลูกค้า

source: Vehicle
th: ยานพาหนะ

source: Rental Period
th: ระยะเวลาเช่า

source: days
th: วัน

# BookingRef
source: Booking Reference
th: รหัสการจอง

source: Line Items
th: รายการ

source: Subtotal
th: ยอดรวม

source: Discount
th: ส่วนลด

source: Total
th: รวมทั้งหมด

source: Add Accessory
th: เพิ่มอุปกรณ์

source: Change Insurance
th: เปลี่ยนประกัน

source: Apply Discount
th: ให้ส่วนลด

source: Proceed to Payment
th: ดำเนินการชำระเงิน

source: Back
th: ย้อนกลับ

source: Remove Item
th: ลบรายการ

source: Security Deposit
th: เงินมัดจำ

source: Deposit Refund
th: คืนเงินมัดจำ

source: Select Accessory
th: เลือกอุปกรณ์

source: No accessories available
th: ไม่มีอุปกรณ์ที่พร้อมใช้งาน

source: Select Insurance
th: เลือกประกัน

source: No Insurance
th: ไม่มีประกัน

source: Percentage
th: เปอร์เซ็นต์

source: Fixed Amount
th: จำนวนเงินคงที่

# DiscountReason
source: Reason for discount
th: เหตุผลในการให้ส่วนลด

# DiscountReasonRequired
source: Reason is required for discounts
th: กรุณาระบุเหตุผลในการให้ส่วนลด

source: Apply
th: ยืนยัน

source: Transaction
th: รายการ

# InsuranceIncluded
source: Insurance
th: ประกันภัย

# IncludedInTotal
source: Included in rental total
th: รวมอยู่ในยอดเช่าแล้ว
