Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Bookings/CreateBooking.*.resx
Languages: ms, th

# PageTitle
source: Create Booking
ms: Buat Tempahan
th: สร้างการจอง

source: Bookings
ms: Tempahan
th: การจอง

source: New Booking
ms: Tempahan Baru
th: จองใหม่

# Header
source: Create New Booking
ms: Buat Tempahan Baru
th: สร้างการจองใหม่

# SubHeader
source: Book vehicles for customers in advance
ms: Tempah kenderaan untuk pelanggan terlebih dahulu
th: จองยานพาหนะล่วงหน้าสำหรับลูกค้า

source: Customer
ms: Pelanggan
th: ลูกค้า

source: Vehicles
ms: Kenderaan
th: ยานพาหนะ

source: Add-ons
ms: Tambahan
th: เพิ่มเติม

source: Payment
ms: Pembayaran
th: ชำระเงิน

# Confirmation
source: Confirm
ms: Sahkan
th: ยืนยัน

source: Customer Name
ms: Nama Pelanggan
th: ชื่อลูกค้า

# CustomerNamePlaceholder
source: Enter customer name
ms: Masukkan nama pelanggan
th: กรอกชื่อลูกค้า

# CustomerPhone
source: Phone Number
ms: Nombor Telefon
th: เบอร์โทรศัพท์

# CustomerPhonePlaceholder
source: Enter phone number
ms: Masukkan nombor telefon
th: กรอกเบอร์โทรศัพท์

# CustomerEmail
source: Email Address
ms: Alamat E-mel
th: อีเมล

# CustomerEmailPlaceholder
source: Enter email address
ms: Masukkan alamat e-mel
th: กรอกอีเมล

source: Nationality
ms: Kewarganegaraan
th: สัญชาติ

# NationalityPlaceholder
source: e.g. British, American
ms: cth. British, Amerika
th: เช่น อังกฤษ, อเมริกัน

# PassportNo
source: Passport Number
ms: Nombor Pasport
th: หมายเลขหนังสือเดินทาง

# PassportNoPlaceholder
source: Enter passport number
ms: Masukkan nombor pasport
th: กรอกหมายเลขหนังสือเดินทาง

# HotelName
source: Hotel / Accommodation
ms: Hotel / Penginapan
th: โรงแรม / ที่พัก

# HotelNamePlaceholder
source: Where is customer staying?
ms: Pelanggan menginap di mana?
th: ลูกค้าพักที่ไหน?

source: Notes
ms: Nota
th: หมายเหตุ

# NotesPlaceholder
source: Special requests or notes
ms: Permintaan khas atau nota
th: คำขอพิเศษหรือหมายเหตุ

# LinkExistingRenter
source: Link to existing customer?
ms: Pautkan kepada pelanggan sedia ada?
th: เชื่อมต่อกับลูกค้าที่มีอยู่?

source: Search
ms: Cari
th: ค้นหา

# SearchRenter
source: Search Customer
ms: Cari Pelanggan
th: ค้นหาลูกค้า

source: Start Date
ms: Tarikh Mula
th: วันที่เริ่ม

source: End Date
ms: Tarikh Tamat
th: วันที่สิ้นสุด

source: Pickup Time
ms: Masa Ambil
th: เวลารับรถ

source: Preferred Shop
ms: Cawangan Pilihan
th: สาขาที่ต้องการ

source: Any shop
ms: Mana-mana cawangan
th: สาขาใดก็ได้

source: Select Vehicles
ms: Pilih Kenderaan
th: เลือกยานพาหนะ

# NoVehiclesAvailable
source: No vehicles available for selected dates
ms: Tiada kenderaan tersedia untuk tarikh yang dipilih
th: ไม่มียานพาหนะว่างสำหรับวันที่เลือก

source: Selected Vehicles
ms: Kenderaan Dipilih
th: ยานพาหนะที่เลือก

source: days
ms: hari
th: วัน

# NoVehiclesSelected
source: No vehicles selected. Go back to select vehicles.
ms: Tiada kenderaan dipilih. Kembali untuk memilih kenderaan.
th: ยังไม่ได้เลือกยานพาหนะ กรุณากลับไปเลือกยานพาหนะ

# Insurance
source: Insurance Package
ms: Pakej Insurans
th: แพ็คเกจประกันภัย

source: No insurance
ms: Tiada insurans
th: ไม่มีประกันภัย

source: Preferred Color
ms: Warna Pilihan
th: สีที่ต้องการ

# PreferredColorPlaceholder
source: e.g. Red, Black
ms: cth. Merah, Hitam
th: เช่น แดง, ดำ

source: Accessories
ms: Aksesori
th: อุปกรณ์เสริม

source: Item Total
ms: Jumlah Item
th: ยอดรวมรายการ

source: Booking Summary
ms: Ringkasan Tempahan
th: สรุปการจอง

source: Total Amount
ms: Jumlah Keseluruhan
th: ยอดรวมทั้งหมด

source: Deposit Required
ms: Deposit Diperlukan
th: เงินมัดจำที่ต้องการ

# RecordPayment
source: Record Payment (Optional)
ms: Rekod Pembayaran (Pilihan)
th: บันทึกการชำระเงิน (ไม่บังคับ)

source: Payment Amount
ms: Jumlah Pembayaran
th: จำนวนเงิน

source: Payment Method
ms: Kaedah Pembayaran
th: วิธีชำระเงิน

source: Cash
ms: Tunai
th: เงินสด

source: Card
ms: Kad
th: บัตรเครดิต

source: Bank Transfer
ms: Pindahan Bank
th: โอนเงิน

# TransactionRef
source: Transaction Reference
ms: Rujukan Transaksi
th: หมายเลขอ้างอิง

# TransactionRefPlaceholder
source: Optional reference number
ms: Nombor rujukan pilihan
th: หมายเลขอ้างอิง (ถ้ามี)

source: Payment Summary
ms: Ringkasan Pembayaran
th: สรุปการชำระเงิน

source: Balance Due
ms: Baki Tertunggak
th: ยอดค้างชำระ

# CustomerInfo
source: Customer Information
ms: Maklumat Pelanggan
th: ข้อมูลลูกค้า

source: Name
ms: Nama
th: ชื่อ

source: Phone
ms: Telefon
th: โทรศัพท์

source: Email
ms: E-mel
th: อีเมล

source: Rental Details
ms: Butiran Sewaan
th: รายละเอียดการเช่า

source: Period
ms: Tempoh
th: ระยะเวลา

source: Duration
ms: Tempoh
th: ระยะเวลา

source: Booking Total
ms: Jumlah Tempahan
th: ยอดรวมการจอง

source: Subtotal
ms: Subjumlah
th: ยอดรวมย่อย

# Deposit
source: Deposit Paid
ms: Deposit Dibayar
th: เงินมัดจำที่ชำระ

source: Balance
ms: Baki
th: ยอดคงเหลือ

source: Create Booking
ms: Buat Tempahan
th: สร้างการจอง

# ProcessingMessage
source: Creating booking...
ms: Membuat tempahan...
th: กำลังสร้างการจอง...

# BookingCreated
source: Booking {0} created successfully!
ms: Tempahan {0} berjaya dibuat!
th: สร้างการจอง {0} สำเร็จ!

# ErrorCreatingBooking
source: Error creating booking: {0}
ms: Ralat membuat tempahan: {0}
th: เกิดข้อผิดพลาดในการสร้างการจอง: {0}

# ErrorLoadingData
source: Error loading data: {0}
ms: Ralat memuatkan data: {0}
th: เกิดข้อผิดพลาดในการโหลดข้อมูล: {0}

# ErrorLoadingVehicles
source: Error loading vehicles: {0}
ms: Ralat memuatkan kenderaan: {0}
th: เกิดข้อผิดพลาดในการโหลดยานพาหนะ: {0}

# SearchRenterHint
source: Search existing customers in the Customers page
ms: Cari pelanggan sedia ada di halaman Pelanggan
th: ค้นหาลูกค้าที่มีอยู่ในหน้าลูกค้า

# AgentReferral
source: Agent Referral (Optional)
ms: Rujukan Ejen (Pilihan)

# SelectAgent
source: Referring Agent
ms: Ejen Perujuk

# NoAgent
source: No agent / Direct booking
ms: Tiada ejen / Tempahan terus

source: Agent Commission
ms: Komisen Ejen

# AgentSurcharge
source: Surcharge
ms: Caj Tambahan

# HideSurchargeFromCustomer
source: Hide from customer
ms: Sembunyikan dari pelanggan

source: Shop Receives
ms: Kedai Terima

# AgentInfo
source: Agent Information
ms: Maklumat Ejen

source: Agent
ms: Ejen

# AgentCommissionInfo
source: Commission type: {0}, Rate: {1}
ms: Jenis komisen: {0}, Kadar: {1}

source: PromptPay
th: พร้อมเพย์

source: Hotel
th: โรงแรม
