Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Accidents/AccidentDetails.*.resx
Languages: th

source: Accident
th: อุบัติเหตุ

source: Back to List
th: กลับไปรายการ

source: Accident Not Found
th: ไม่พบข้อมูลอุบัติเหตุ

# AccidentNotFoundDesc
source: The accident record #{0} was not found.
th: ไม่พบข้อมูลอุบัติเหตุหมายเลข #{0}

source: Summary
th: สรุป

source: Reference
th: อ้างอิง

source: Accident Date
th: วันที่เกิดอุบัติเหตุ

source: Reported Date
th: วันที่รายงาน

source: Vehicle
th: ยานพาหนะ

source: License Plate
th: ทะเบียนรถ

source: Renter
th: ผู้เช่า

source: Indicators
th: ตัวชี้วัด

source: Police Involved
th: มีการแจ้งตำรวจ

source: Yes
th: ใช่

source: No
th: ไม่ใช่

source: Case No
th: เลขที่คดี

source: Insurance Claim
th: การเคลมประกัน

source: Filed
th: ยื่นเคลมแล้ว

source: Not Filed
th: ยังไม่ได้ยื่นเคลม

source: Claim No
th: เลขที่เคลม

source: Financial Summary
th: สรุปการเงิน

source: Estimated
th: ประมาณการ

source: Actual
th: ค่าใช้จ่ายจริง

source: Insurance Payout
th: ยอดจ่ายจากประกัน

source: Net Cost
th: ต้นทุนสุทธิ

source: Reserve
th: เงินสำรอง

source: Details
th: รายละเอียด

source: Parties
th: คู่กรณี

source: Documents
th: เอกสาร

source: Costs
th: ค่าใช้จ่าย

source: Timeline
th: ลำดับเหตุการณ์

source: Comments
th: ความคิดเห็น

source: Resolution
th: การแก้ไข

source: Resolved On
th: แก้ไขเมื่อ

source: Resolved By
th: แก้ไขโดย

source: Notes
th: บันทึก

source: Start Investigation
th: เริ่มการตรวจสอบ

source: Resolve
th: แก้ไขเสร็จสิ้น
