Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Accidents/AddCostDialog.*.resx
Languages: th

source: Cost Type
th: ประเภทค่าใช้จ่าย

# IsCredit
source: This is a credit (e.g., insurance payout)
th: เป็นรายการรับ (เช่น เงินเคลมประกัน)

source: Description
th: คำอธิบาย

# DescriptionPlaceholder
source: Describe this cost
th: อธิบายค่าใช้จ่ายนี้

source: Estimated Amount
th: จำนวนเงินโดยประมาณ

source: Actual Amount
th: จำนวนเงินจริง

# ActualAmountHint
source: Leave empty if not paid yet
th: เว้นว่างไว้หากยังไม่มีการชำระเงิน

# VendorName
source: Vendor / Payee
th: ผู้ขาย / ผู้รับเงิน

# VendorPlaceholder
source: Who will be paid / who paid
th: ใครคือผู้รับเงิน / ใครเป็นคนจ่าย

source: Reference Number
th: เลขที่อ้างอิง

# ReferencePlaceholder
source: Invoice, receipt number
th: เลขที่ใบแจ้งหนี้, เลขที่ใบเสร็จ

source: Paid Date
th: วันที่ชำระเงิน

source: Approved
th: อนุมัติแล้ว

source: Notes
th: หมายเหตุ

# NotesPlaceholder
source: Additional notes
th: หมายเหตุเพิ่มเติม

source: Cancel
th: ยกเลิก

# SaveFailed
source: Save failed: {0}
th: บันทึกไม่สำเร็จ: {0}

# Error
source: Error: {0}
th: ข้อผิดพลาด: {0}
