Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Accidents/AddPartyDialog.*.resx
Languages: th

source: Party Type
th: ประเภทผู้เกี่ยวข้อง

source: Name
th: ชื่อ

# NamePlaceholder
source: Full name or organization name
th: ชื่อ-นามสกุล หรือ ชื่อองค์กร

source: Phone
th: เบอร์โทรศัพท์

source: Email
th: อีเมล

source: Address
th: ที่อยู่

# AddressPlaceholder
source: Physical address
th: ที่อยู่ติดต่อ

source: ID Number
th: หมายเลขประจำตัว

# IdNumberPlaceholder
source: Passport, National ID, License
th: พาสปอร์ต, บัตรประชาชน, ใบขับขี่

source: Organization
th: องค์กร

# OrganizationPlaceholder
source: Company or organization name
th: ชื่อบริษัทหรือหน่วยงาน

source: Badge Number
th: หมายเลขตราสัญลักษณ์

source: Vehicle License Plate
th: เลขทะเบียนรถ

source: Insurance Policy No
th: เลขที่กรมธรรม์ประกันภัย

source: Involvement Description
th: รายละเอียดความเกี่ยวข้อง

# InvolvementPlaceholder
source: Describe how this party was involved
th: อธิบายว่าฝ่ายนี้เกี่ยวข้องอย่างไร

source: Injured
th: ได้รับบาดเจ็บ

source: Injury Description
th: รายละเอียดการบาดเจ็บ

# InjuryPlaceholder
source: Describe injuries
th: อธิบายอาการบาดเจ็บ

source: At Fault
th: เป็นฝ่ายผิด

source: Fault Percentage
th: สัดส่วนความผิด

source: Notes
th: หมายเหตุ

# NotesPlaceholder
source: Additional notes
th: หมายเหตุเพิ่มเติม

source: Cancel
th: ยกเลิก

# SaveFailed
source: Save failed: {0}
th: บันทึกไม่สำเร็จ: {0}

# Error
source: Error: {0}
th: ข้อผิดพลาด: {0}
