Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Accidents/PartiesTab.*.resx
Languages: th

source: Parties Involved
th: ผู้เกี่ยวข้อง

source: Add Party
th: เพิ่มผู้เกี่ยวข้อง

# NoPartiesAdded
source: No parties added yet
th: ยังไม่มีการเพิ่มผู้เกี่ยวข้อง

source: Type
th: ประเภท

source: Name
th: ชื่อ

source: Contact
th: ติดต่อ

source: Status
th: สถานะ

source: Injured
th: บาดเจ็บ

source: At Fault
th: ฝ่ายผิด

source: Edit Party
th: แก้ไขข้อมูลผู้เกี่ยวข้อง
