Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Accidents/ReportAccidentDialog.*.resx
Languages: th

source: Basic Info
th: ข้อมูลพื้นฐาน

source: Details
th: รายละเอียด

source: Classification
th: การจัดประเภท

source: Vehicle
th: รถ

source: -- Select Vehicle --
th: -- เลือกรถ --

source: Linked Rental
th: รายการเช่าที่เกี่ยวข้อง

# NoRental
source: -- No Rental (Private/Other) --
th: -- ไม่มีรายการเช่า (ส่วนตัว/อื่นๆ) --

# RentalHint
source: Select the active rental associated with this accident
th: เลือกรายการเช่าที่กำลังดำเนินการซึ่งเกี่ยวข้องกับอุบัติเหตุนี้

source: Accident Date
th: วันที่เกิดอุบัติเหตุ

source: Title
th: หัวข้อ

# TitlePlaceholder
source: Brief summary of the incident
th: สรุปเหตุการณ์สั้นๆ

source: Location
th: สถานที่

# LocationPlaceholder
source: Where did it happen?
th: เกิดขึ้นที่ไหน?

source: Description
th: คำอธิบาย

# DescriptionPlaceholder
source: Describe what happened in detail...
th: อธิบายรายละเอียดสิ่งที่เกิดขึ้น...

source: GPS Coordinates
th: พิกัด GPS

# GpsPlaceholder
source: Lat, Lng
th: ละติจูด, ลองจิจูด

# GpsHint
source: Helpful for accurate reporting and assistance
th: มีประโยชน์สำหรับการรายงานและให้ความช่วยเหลือที่แม่นยำ

source: Severity
th: ความรุนแรง

source: Estimated Cost
th: ค่าเสียหายโดยประมาณ

source: Police Involved
th: ตำรวจมีส่วนเกี่ยวข้อง

source: Police Case Number
th: เลขที่คดี

# CaseNumberPlaceholder
source: Case #
th: เลขที่คดี

source: Insurance Claim Filed
th: มีการแจ้งเคลมประกัน

source: Insurance Claim Number
th: เลขที่เคลมประกัน

# ClaimNumberPlaceholder
source: Claim #
th: เลขที่เคลม

source: Reserve Amount
th: วงเงินสำรอง

# ReserveHint
source: Amount set aside for potential liability
th: จำนวนเงินที่สำรองไว้สำหรับความรับผิดที่อาจเกิดขึ้น

source: Cancel
th: ยกเลิก

source: Report Accident
th: รายงานอุบัติเหตุ

# PleaseSelectVehicle
source: Please select a vehicle
th: กรุณาเลือกรถ

# FailedToReportAccident
source: Failed to report accident: {0}
th: รายงานอุบัติเหตุไม่สำเร็จ: {0}

# Error
source: Error: {0}
th: ข้อผิดพลาด: {0}

# SeverityMinor
source: Minor - Scratches, scuffs (cosmetic)
th: เล็กน้อย - รอยขีดข่วน, ถลอก (ภายนอก)

# SeverityModerate
source: Moderate - Dents, mechanical damage
th: ปานกลาง - รอยบุบ, ความเสียหายทางกลไก

# SeverityMajor
source: Major - Significant damage, expensive repair
th: รุนแรง - ความเสียหายมาก, ค่าซ่อมสูง

# SeverityInjury
source: Injury - Personal injury occurred
th: บาดเจ็บ - มีผู้ได้รับบาดเจ็บ

# SeverityHospitalization
source: Hospitalization - Hospital treatment required
th: ส่งโรงพยาบาล - ต้องเข้ารับการรักษาในโรงพยาบาล

# SeverityFatality
source: Fatality - Death occurred
th: เสียชีวิต - มีผู้เสียชีวิต
