Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Rentals/CheckIn.*.resx
Languages: th

# PageTitle
source: New Check-In - MotoRent
th: บันทึกการเช่าใหม่ - MotoRent

# Header
source: New Check-In
th: บันทึกการเช่าใหม่

# SubHeader
source: Complete all steps to create a new rental
th: ดำเนินการตามขั้นตอนเพื่อสร้างรายการเช่าใหม่

# ProcessingMessage
source: Processing Check-In...
th: กำลังดำเนินการบันทึกการเช่า...

# RenterCreatedSuccess
source: Renter created. You can now proceed.
th: สร้างข้อมูลผู้เช่าเรียบร้อยแล้ว คุณสามารถดำเนินการต่อได้

# ValidationError
source: Please select a renter and motorbike
th: โปรดเลือกผู้เช่าและยานพาหนะ

# CheckInSuccess
source: Check-in completed! Rental #{0}
th: บันทึกการเช่าเสร็จสิ้น! รายการเช่าเลขที่ #{0}

# CheckInFailed
source: Check-in failed: {0}
th: บันทึกการเช่าล้มเหลว: {0}

source: Renter
th: ผู้เช่า

source: Vehicle
th: ยานพาหนะ

source: Configure
th: กำหนดค่า

source: Deposit
th: เงินมัดจำ

source: Agreement
th: สัญญา

source: Inspection
th: ตรวจสอบ

source: Pre-Rental Inspection
th: ตรวจสอบก่อนเช่า

# PreRentalInspectionDesc
source: Record who inspected the vehicle before handing it to the renter
th: บันทึกผู้ที่ตรวจสอบยานพาหนะก่อนส่งมอบให้ผู้เช่า

source: Inspector Details
th: รายละเอียดผู้ตรวจสอบ

# InspectionRecorded
source: Inspection recorded by {0}
th: บันทึกการตรวจสอบโดย {0}

# InspectionRecordedWithAffiliation
source: Inspection recorded by {0} ({1})
th: บันทึกการตรวจสอบโดย {0} ({1})

# SelectRenter
source: Select a Renter
th: เลือกผู้เช่า

# SelectRenterDesc
source: Search for an existing renter or create a new one
th: ค้นหาผู้เช่าเดิมหรือสร้างผู้เช่าใหม่

source: Search Renter
th: ค้นหาผู้เช่า

# SearchRenterPlaceholder
source: Search by name, phone, or passport...
th: ค้นหาตามชื่อ, เบอร์โทรศัพท์ หรือพาสปอร์ต...

source: No renters found
th: ไม่พบข้อมูลผู้เช่า

source: Create New Renter
th: สร้างผู้เช่าใหม่

source: Recent Renters
th: ผู้เช่าล่าสุด

source: Selected
th: เลือกแล้ว

source: Renter Details
th: รายละเอียดผู้เช่า

source: Nationality
th: สัญชาติ

source: Passport/ID
th: พาสปอร์ต/บัตรประชาชน

source: Email
th: อีเมล

source: Hotel
th: โรงแรม

source: Driving License
th: ใบขับขี่

# SelectVehicle
source: Select a Vehicle
th: เลือกยานพาหนะ

# SelectVehicleDesc
source: Choose an available vehicle for this rental
th: เลือกยานพาหนะที่ว่างสำหรับการเช่านี้

source: All
th: ทั้งหมด

source: All Brands
th: ทุกยี่ห้อ

source: Include Pooled
th: รวมรถในพูล

source: Available
th: ว่าง

source: Engine
th: เครื่องยนต์

source: Segment
th: เซ็กเมนต์

source: Seats
th: ที่นั่ง

source: Capacity
th: ความจุ

source: Year
th: ปี

source: Color
th: สี

source: Driver Available
th: มีบริการคนขับ

source: Guide Available
th: มีบริการไกด์

source: Hourly Rate
th: อัตราต่อชั่วโมง

source: Daily Rate
th: อัตราต่อวัน

# AtAnotherShop
source: At another shop - may need pickup
th: อยู่ที่สาขาอื่น - อาจต้องไปรับรถ

# NoVehiclesFound
source: No available vehicles found. All vehicles may be currently rented or under maintenance.
th: ไม่พบยานพาหนะที่ว่าง ยานพาหนะทั้งหมดอาจกำลังถูกเช่าหรืออยู่ระหว่างการซ่อมบำรุง

# IncludePooledHint
source: Try enabling "Include Pooled" to see vehicles from partner shops.
th: ลองเปิดใช้งาน "รวมรถในพูล" เพื่อดูยานพาหนะจากสาขาพันธมิตร

source: Configure Rental
th: กำหนดค่าการเช่า

# ConfigureRentalDesc
source: Set the rental period and select optional insurance and accessories
th: กำหนดระยะเวลาการเช่า และเลือกประกันและอุปกรณ์เสริมเพิ่มเติม

source: Rental Period
th: ระยะเวลาการเช่า

source: Start Date
th: วันที่เริ่มต้น

source: End Date
th: วันที่สิ้นสุด

source: Duration
th: ระยะเวลา

source: days
th: วัน

source: 1 Day
th: 1 วัน

source: 3 Days
th: 3 วัน

source: 1 Week
th: 1 สัปดาห์

source: 2 Weeks
th: 2 สัปดาห์

source: 1 Month
th: 1 เดือน

source: Driver & Guide Options
th: ตัวเลือกคนขับและไกด์

source: Include Driver
th: รวมคนขับ

# DriverDesc
source: Professional driver for your trip
th: คนขับมืออาชีพสำหรับการเดินทางของคุณ

source: Include Tour Guide
th: รวมมัคคุเทศก์ (ไกด์)

# TourGuideDesc
source: Local guide for sightseeing
th: ไกด์ท้องถิ่นสำหรับการนำเที่ยว

source: Insurance Package
th: แพ็กเกจประกันภัย

source: No Insurance
th: ไม่มีประกันภัย

# NoInsuranceDesc
source: You are responsible for all damage costs
th: คุณต้องรับผิดชอบค่าใช้จ่ายความเสียหายทั้งหมดเอง

source: Max coverage
th: วงเงินคุ้มครองสูงสุด

source: Deductible
th: ค่าเสียหายส่วนแรก

source: Accessories
th: อุปกรณ์เสริม

source: Free
th: ฟรี

source: Included with rental
th: รวมอยู่ในการเช่าแล้ว

source: Pick-up & Drop-off
th: การรับและส่งคืนรถ

source: Pick-up Location
th: สถานที่รับรถ

source: At Shop (Free)
th: ที่ร้าน (ฟรี)

source: Pick-up Time
th: เวลาที่รับรถ

source: Drop-off Location (Expected)
th: สถานที่ส่งคืนรถ (โดยประมาณ)

source: Expected Drop-off Time
th: เวลาที่คาดว่าจะส่งคืนรถ

source: Location/timing fees
th: ค่าธรรมเนียมสถานที่/เวลา

source: Price Summary
th: สรุปราคา

source: Total
th: ยอดรวม

source: Required Deposit
th: เงินมัดจำที่ต้องชำระ

source: Configure Interval Rental
th: กำหนดค่าการเช่ารายชั่วโมง

# ConfigureIntervalRentalDesc
source: Select the rental duration for your jet ski experience
th: เลือกระยะเวลาการเช่าสำหรับเจ็ทสกีของคุณ

source: Select Duration
th: เลือกระยะเวลา

source: 15 min
th: 15 นาที

source: 30 min
th: 30 นาที

source: 1 hour
th: 1 ชั่วโมง

source: Start Time
th: เวลาเริ่มต้น

source: Date
th: วันที่

source: Time
th: เวลา

source: Rental ends at
th: สิ้นสุดการเช่าเวลา

source: Safety Notice
th: ประกาศความปลอดภัย

# SafetyNoticeDesc
source: All riders must wear life jackets at all times. Age restrictions apply. A safety briefing will be provided before the ride.
th: ผู้เล่นทุกคนต้องสวมเสื้อชูชีพตลอดเวลา มีการจำกัดอายุผู้เล่น จะมีการบรรยายสรุปความปลอดภัยก่อนเริ่มกิจกรรม

source: Jet Ski
th: เจ็ทสกี

# SelectDurationHint
source: Please select a duration to see pricing
th: โปรดเลือกระยะเวลาเพื่อดูราคา

source: Payment & Deposit
th: การชำระเงินและมัดจำ

# PaymentDepositDesc
source: Collect the rental payment and security deposit before proceeding
th: รับชำระค่าเช่าและเงินมัดจำก่อนดำเนินการต่อ

source: Rental Amount
th: ค่าเช่า

source: Rental Payment Method
th: วิธีการชำระค่าเช่า

source: Cash
th: เงินสด

source: Card
th: บัตรเครดิต/เดบิต

source: Bank Transfer
th: โอนเงินผ่านธนาคาร

source: QR Code
th: คิวอาร์โค้ด (QR Code)

source: Transaction Reference
th: รหัสอ้างอิงการทำรายการ

source: Deposit Type
th: ประเภทเงินมัดจำ

# CashDepositDesc
source: Collect cash deposit from the renter
th: รับเงินสดมัดจำจากผู้เช่า

# CardPreAuth
source: Card Pre-Authorization
th: การกันวงเงินบัตร (Pre-Auth)

# CardPreAuthDesc
source: Hold the amount on the renter's credit/debit card
th: กันวงเงินในบัตรเครดิต/เดบิตของผู้เช่า

source: Passport Hold
th: เก็บพาสปอร์ต

# PassportHoldDesc
source: Hold the renter's passport as deposit (not recommended)
th: เก็บพาสปอร์ตของผู้เช่าไว้เป็นหลักประกัน (ไม่แนะนำ)

source: Cash Collection
th: การรับเงินสด

# AmountCollected
source: Amount Collected (THB)
th: จำนวนเงินที่ได้รับ (บาท)

source: Set to
th: ตั้งเป็น

# AmountLessHint
source: Amount is less than required deposit. Please collect {0} more.
th: จำนวนเงินน้อยกว่าเงินมัดจำที่ต้องชำระ โปรดเรียกเก็บเพิ่มอีก {0}

# AmountExceedsHint
source: Amount exceeds required deposit by {0}.
th: จำนวนเงินเกินกว่าเงินมัดจำที่ต้องชำระมา {0}

# CardPreAuthDetails
source: Card Pre-Authorization Details
th: รายละเอียดการกันวงเงินบัตร

# CardLast4
source: Card Last 4 Digits
th: เลขท้ายบัตร 4 หลัก

# AuthReference
source: Authorization Reference
th: รหัสอ้างอิงการอนุมัติ (Authorization Reference)

# PreAuthAmount
source: Pre-Auth Amount (THB)
th: จำนวนเงินที่กันไว้ (บาท)

# PassportHoldWarning
source: Note: Holding passports as deposit is not recommended and may be illegal in some jurisdictions. Consider using cash or card pre-authorization instead.
th: หมายเหตุ: ไม่แนะนำให้เก็บพาสปอร์ตไว้เป็นหลักประกัน และอาจผิดกฎหมายในบางพื้นที่ โปรดพิจารณาการใช้เงินสดหรือการกันวงเงินบัตรแทน

# PassportNumber
source: Passport Number (for reference)
th: หมายเลขพาสปอร์ต (เพื่อการอ้างอิง)

source: Deposit confirmed
th: ยืนยันเงินมัดจำแล้ว

source: Passport held
th: เก็บพาสปอร์ตแล้ว

# ConfirmCashCollected
source: I confirm that I have collected {0} in cash as deposit
th: ฉันขอยืนยันว่าได้รับเงินสดจำนวน {0} เป็นเงินมัดจำแล้ว

# ConfirmCardPreAuth
source: I confirm that the card pre-authorization of {0} has been successfully processed
th: ฉันขอยืนยันว่าการกันวงเงินบัตรจำนวน {0} ดำเนินการสำเร็จแล้ว

# ConfirmPassportCollected
source: I confirm that the renter's passport has been collected and stored securely
th: ฉันขอยืนยันว่าได้เก็บพาสปอร์ตของผู้เช่าไว้ในที่ปลอดภัยแล้ว

# ConfirmDepositCollected
source: I confirm the deposit has been collected
th: ฉันขอยืนยันว่าได้รับเงินมัดจำเรียบร้อยแล้ว

source: Agreement & Signature
th: สัญญาและลายเซ็น

# AgreementSignatureDesc
source: Review the rental summary and print the agreement for renter's signature
th: ตรวจสอบสรุปการเช่าและพิมพ์สัญญาเพื่อให้ผู้เช่าลงนาม

source: Rental Summary
th: สรุปการเช่า

source: Phone
th: เบอร์โทรศัพท์

source: Terms & Conditions
th: ข้อกำหนดและเงื่อนไข

# ExplainTermsConfirm
source: I have read and explained the terms to the renter
th: ฉันได้อ่านและอธิบายข้อกำหนดให้ผู้เช่าฟังแล้ว

source: Print Agreement
th: พิมพ์สัญญา

# PrintAgreementDesc
source: Print the rental agreement for the renter to sign. Keep the signed copy in the shop records.
th: พิมพ์สัญญาเช่ายานพาหนะเพื่อให้ผู้เช่าลงนาม โปรดเก็บสำเนาที่มีลายเซ็นไว้ในประวัติของร้าน

# AgreementPrinted
source: Agreement printed - collect signed copy from renter
th: พิมพ์สัญญาแล้ว - โปรดรับเอกสารที่ลงนามจากผู้เช่า

# PrintAgreementHint
source: Print the agreement and have the renter sign the physical copy
th: พิมพ์สัญญาและให้ผู้เช่าลงนามในเอกสารจริง

source: Complete Check-In
th: บันทึกการเช่าเสร็จสิ้น

source: Motorbike
th: รถจักรยานยนต์

source: Car
th: รถยนต์

source: Boat
th: เรือ

source: Van
th: รถตู้

source: Rate
th: ราคา

source: Driver
th: คนขับ

source: Insurance
th: ประกันภัย

source: Total Amount
th: ยอดรวม

# ErrorLoading
source: Error: {0}
th: ข้อผิดพลาด: {0}

# ShopRequired
source: Please select a shop before starting check-in
th: กรุณาเลือกสาขาก่อนเริ่มเช็คอิน
