Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Rentals/CheckOutDialog.*.resx
Languages: th

source: Return
th: การคืนรถ

source: Damage
th: ความเสียหาย

source: Settle
th: การชำระเงิน

source: Renter
th: ผู้เช่า

source: Started
th: เริ่มเมื่อ

source: Expected
th: ครบกำหนด

source: Return Information
th: ข้อมูลการคืนรถ

source: Actual Return Date
th: วันที่คืนจริง

# MileageAtReturn
source: Mileage at Return (km)
th: เลขไมล์เมื่อคืนรถ (กม.)

source: Return Location
th: สถานที่คืนรถ

source: Current Shop
th: สาขาปัจจุบัน

# TransferHint
source: Vehicle will be transferred to the selected shop
th: ยานพาหนะจะถูกโอนไปยังสาขาที่เลือก

source: Drop-off Service Location
th: สถานที่บริการส่งรถ (Drop-off)

source: At Shop (Free)
th: ที่ร้าน (ฟรี)

source: Drop-off Time
th: เวลาที่คืนรถ

source: Drop-off fees
th: ค่าธรรมเนียมการคืนรถ

source: Late Return
th: คืนรถเกินกำหนด

# OverdueDaysCharge
source: {0} day(s) overdue Â· +{1}
th: เกินกำหนด {0} วัน · +{1}

source: Early Return
th: คืนรถก่อนกำหนด

# ReturningEarly
source: Returning {0} day(s) early
th: คืนรถก่อนกำหนด {0} วัน

# ReturnNotes
source: Return Notes (Optional)
th: บันทึกการคืนรถ (ไม่บังคับ)

# ReturnNotesPlaceholder
source: Any notes about the return...
th: บันทึกเพิ่มเติมเกี่ยวกับการคืนรถ...

source: Next: Damage Check
th: ถัดไป: ตรวจสอบความเสียหาย

source: Vehicle Condition
th: สภาพยานพาหนะ

source: No Damage
th: ไม่มีความเสียหาย

source: Good condition
th: สภาพดี

source: Minor
th: เล็กน้อย

source: Scratches, scuffs
th: รอยขีดข่วน, รอยถลอก

source: Moderate
th: ปานกลาง

# RepairsNeeded
source: Dents, repairs needed
th: รอยบุบ, ต้องมีการซ่อมแซม

source: Major
th: รุนแรง

source: Significant damage
th: ความเสียหายรุนแรง

source: Damage Details
th: รายละเอียดความเสียหาย

# DescribeDamage
source: Describe the damage
th: อธิบายความเสียหาย

# DescribeDamagePlaceholder
source: What damage was found?
th: พบความเสียหายส่วนใดบ้าง?

source: Estimated Repair Cost
th: ประมาณการค่าซ่อมแซม

source: Damage Photos
th: รูปภาพความเสียหาย

# DamagePhotosDesc
source: Take photos for documentation
th: ถ่ายรูปเพื่อเป็นหลักฐาน

# DeductedFromDeposit
source: Amount will be deducted from deposit
th: ยอดเงินจะถูกหักจากเงินมัดจำ

source: Back
th: ย้อนกลับ

source: Next: Settlement
th: ถัดไป: สรุปยอดชำระ

source: Charges Summary
th: สรุปค่าใช้จ่าย

source: Original Rental
th: ค่าเช่าเดิม

source: Paid
th: ชำระแล้ว

# ExtraDays
source: Extra Days ({0})
th: จำนวนวันที่เกิน ({0})

source: Additional Due
th: ยอดค้างชำระเพิ่มเติม

source: Deposit Settlement
th: การคืนเงินมัดจำ

source: Deposit Held
th: เงินมัดจำที่ถือไว้

source: Deductions
th: ยอดหัก

source: Refund Amount
th: ยอดเงินคืน

source: Payment Required
th: ต้องชำระเงินเพิ่ม

# CollectFromRenter
source: Collect {0} from renter
th: เรียกเก็บจากผู้เช่าจำนวน {0}

source: Refund Method
th: วิธีการคืนเงิน

source: Cash
th: เงินสด

source: Card
th: บัตรเครดิต/เดบิต

source: Bank
th: โอนเงินผ่านธนาคาร

source: Maintenance Notice
th: การแจ้งเตือนการซ่อมบำรุง

source: overdue
th: เกินกำหนด

source: due soon
th: ครบกำหนดเร็วๆ นี้

# Acknowledge
source: I acknowledge this
th: รับทราบข้อมูลแล้ว

source: Complete
th: เสร็จสิ้น

# ConfirmRefundProcessed
source: I confirm the refund of {0} has been processed via {1}
th: ฉันขอยืนยันว่าได้คืนเงินจำนวน {0} ผ่านทาง {1} เรียบร้อยแล้ว

# ConfirmAdditionalCollected
source: I confirm the additional payment of {0} has been collected
th: ฉันขอยืนยันว่าได้รับชำระเงินเพิ่มเติมจำนวน {0} เรียบร้อยแล้ว

# NoRefundNeeded
source: No refund needed - deposit covers all charges
th: ไม่ต้องคืนเงิน - เงินมัดจำครอบคลุมค่าใช้จ่ายทั้งหมดแล้ว

source: Check-out completed.
th: ดำเนินการคืนรถเรียบร้อยแล้ว

# RefundLabel
source: Refund: {0}
th: เงินคืน: {0}

# VehicleTransferred
source: Vehicle transferred to {0}
th: โอนย้ายยานพาหนะไปยัง {0}

# CheckOutFailed
source: Check-out failed: {0}
th: การคืนรถล้มเหลว: {0}

# ErrorLoading
source: Error: {0}
th: ข้อผิดพลาด: {0}

source: Motorbike
th: รถจักรยานยนต์

source: Car
th: รถยนต์

source: Jet Ski
th: เจ็ทสกี

source: Boat
th: เรือ

source: Van
th: รถตู้

source: Vehicle
th: ยานพาหนะ
