Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Rentals/RentalDetails.*.resx
Languages: ms, th

source: Rental Details
ms: Butiran Sewaan
th: รายละเอียดการเช่า

source: Back to Rentals
ms: Kembali ke Senarai Sewaan
th: กลับไปยังรายการเช่า

source: Start Rental
ms: Mula Sewaan
th: เริ่มการเช่า

source: Check Out
ms: Pulang
th: คืนรถ

source: Extend
ms: Lanjutkan
th: ต่อเวลา

source: Cancel
ms: Batal
th: ยกเลิก

source: View Invoice
ms: Lihat Invois
th: ดูใบแจ้งหนี้

source: Add Payment
ms: Tambah Pembayaran
th: เพิ่มการชำระเงิน

source: Rental Not Found
ms: Sewaan Tidak Dijumpai
th: ไม่พบรายการเช่า

# RentalNotFoundDesc
source: The rental #{0} could not be found.
ms: Sewaan #{0} tidak dijumpai.
th: ไม่พบรายการเช่า #{0}

# OverdueAlert
source: This rental is {0} day(s) overdue!
ms: Sewaan ini tertunggak {0} hari!
th: การเช่านี้เกินกำหนด {0} วัน!

# DueToday
source: This rental is due today!
ms: Sewaan ini tamat tempoh hari ini!
th: การเช่านี้ครบกำหนดวันนี้!

# CrossShopReturn
source: Vehicle returned to {0}
ms: Kenderaan dipulangkan ke {0}
th: คืนรถที่ {0}

source: Summary
ms: Ringkasan
th: สรุป

source: Duration
ms: Tempoh
th: ระยะเวลา

source: Start Date
ms: Tarikh Mula
th: วันที่เริ่ม

source: Expected End
ms: Tarikh Pulang Jangkaan
th: วันที่คาดว่าจะคืน

source: Actual End
ms: Tarikh Pulang Sebenar
th: วันที่คืนจริง

source: Rate
ms: Kadar
th: อัตรา

source: Total Amount
ms: Jumlah Keseluruhan
th: ยอดรวม

source: Notes
ms: Nota
th: หมายเหตุ

source: Deposit
th: เงินมัดจำ

source: Deposit Type
ms: Jenis Deposit
th: ประเภทเงินมัดจำ

source: Amount
ms: Jumlah
th: จำนวน

source: Status
th: สถานะ

source: Collected On
ms: Tarikh Kutip
th: วันที่เก็บ

source: Card
ms: Kad
th: บัตร

source: Reference
ms: Rujukan
th: อ้างอิง

source: Refunded On
ms: Tarikh Bayar Balik
th: วันที่คืนเงิน

source: Financial Summary
ms: Ringkasan Kewangan
th: สรุปการเงิน

source: Rental Amount
ms: Jumlah Sewaan
th: ค่าเช่า

source: Insurance
ms: Insurans
th: ประกันภัย

source: Driver Fee
ms: Yuran Pemandu
th: ค่าคนขับ

source: Guide Fee
ms: Yuran Pemandu Pelancong
th: ค่าไกด์

source: Accessories
ms: Aksesori
th: อุปกรณ์เสริม

source: Total
ms: Jumlah
th: รวม

source: Deposit Held
ms: Deposit Ditahan
th: เงินมัดจำที่ถือไว้

source: Total Paid
ms: Jumlah Dibayar
th: ยอดชำระแล้ว

source: Renter Details
ms: Butiran Penyewa
th: รายละเอียดผู้เช่า

source: View Profile
ms: Lihat Profil
th: ดูโปรไฟล์

source: Full Name
ms: Nama Penuh
th: ชื่อ-นามสกุล

source: Phone
ms: Telefon
th: โทรศัพท์

source: Email
ms: E-mel
th: อีเมล

source: Nationality
ms: Kewarganegaraan
th: สัญชาติ

source: Passport No
ms: No. Pasport
th: หมายเลขพาสปอร์ต

source: Driving License
ms: Lesen Memandu
th: ใบขับขี่

source: Hotel
th: โรงแรม

source: Emergency Contact
ms: Hubungan Kecemasan
th: ติดต่อฉุกเฉิน

source: Vehicle Details
ms: Butiran Kenderaan
th: รายละเอียดยานพาหนะ

source: View Vehicle
ms: Lihat Kenderaan
th: ดูยานพาหนะ

source: Vehicle
ms: Kenderaan
th: ยานพาหนะ

source: License Plate
ms: Plat Nombor
th: ทะเบียน

source: Type
ms: Jenis
th: ประเภท

source: Color
ms: Warna
th: สี

source: Year
ms: Tahun
th: ปี

source: Engine
ms: Enjin
th: เครื่องยนต์

source: Mileage Start
ms: Kilometer Mula
th: เลขไมล์เริ่มต้น

source: Mileage End
ms: Kilometer Pulang
th: เลขไมล์คืน

source: Distance
ms: Jarak
th: ระยะทาง

source: Payments
ms: Pembayaran
th: การชำระเงิน

source: Date
ms: Tarikh
th: วันที่

source: Method
ms: Kaedah
th: วิธีการ

# NoPayments
source: No payments recorded
ms: Tiada rekod pembayaran
th: ไม่มีรายการชำระเงิน

source: Damage Reports
ms: Laporan Kerosakan
th: รายงานความเสียหาย

source: Record Damage
ms: Rekod Kerosakan
th: บันทึกความเสียหาย

source: Estimated Cost
ms: Kos Anggaran
th: ค่าใช้จ่ายประมาณ

source: Actual Cost
ms: Kos Sebenar
th: ค่าใช้จ่ายจริง

# NoDamages
source: No damage reports
ms: Tiada laporan kerosakan
th: ไม่มีรายงานความเสียหาย

source: Accessory
ms: Aksesori
th: อุปกรณ์เสริม

source: Quantity
ms: Kuantiti
th: จำนวน

source: Charged
ms: Dicaj
th: ค่าบริการ

source: Comments
ms: Komen
th: ความคิดเห็น

source: Location Fees
th: ค่าธรรมเนียมสถานที่

source: Total Location Fees
th: รวมค่าธรรมเนียมสถานที่

source: Pick-up & Drop-off Locations
th: สถานที่รับและส่งคืนรถ

source: Pick-up Location
th: สถานที่รับรถ

source: Pick-up Time
th: เวลาที่รับรถ

source: Drop-off Location
th: สถานที่ส่งคืนรถ

source: Drop-off Time
th: เวลาที่ส่งคืนรถ

source: Location Fee
th: ค่าบริการนอกสถานที่

source: Out-of-Hours Fee
th: ค่าบริการนอกเวลาทำการ

# ConfirmStartRental
source: Start rental for {0}?
th: เริ่มการเช่าสำหรับ {0} ใช่หรือไม่?

source: Rental started
th: เริ่มการเช่าเรียบร้อยแล้ว

# StartRentalFailed
source: Failed to start rental: {0}
th: เริ่มการเช่าล้มเหลว: {0}

# ConfirmCheckOut
source: Check out {0} returning {1}?
th: ต้องการคืนรถสำหรับ {0} ที่คืน {1} ใช่หรือไม่?

# CheckOutCompleted
source: Check-out completed. Refund: {0}
th: คืนรถเรียบร้อยแล้ว เงินคืน: {0}

# CheckOutFailed
source: Check-out failed: {0}
th: การคืนรถล้มเหลว: {0}

# ConfirmExtend
source: Extend rental by 1 day? New end date: {0}
th: ต้องการขยายเวลาเช่าอีก 1 วัน ใช่หรือไม่? วันที่คืนใหม่: {0}

# ExtendSuccess
source: Rental extended successfully
th: ขยายเวลาเช่าเรียบร้อยแล้ว

# ExtendFailed
source: Extension failed: {0}
th: การขยายเวลาล้มเหลว: {0}

# ConfirmCancel
source: Cancel rental for {0}? The deposit will be refunded.
th: คุณต้องการยกเลิกรายการเช่าสำหรับ {0} ใช่หรือไม่? (เงินมัดจำจะถูกคืน)

source: Cancel Rental
th: ยกเลิกรายการเช่า

# CancelSuccess
source: Rental cancelled and deposit refunded
th: ยกเลิกรายการเช่าและคืนเงินมัดจำเรียบร้อยแล้ว

# CancelFailed
source: Cancellation failed: {0}
th: การยกเลิกล้มเหลว: {0}

source: Active
th: กำลังเช่า

source: Reserved
th: จองแล้ว

source: Completed
th: เสร็จสิ้น

source: Cancelled
th: ยกเลิก

source: Held
th: เก็บไว้

source: Refunded
th: คืนเงินแล้ว

source: Forfeited
th: ถูกริบ

source: Rental
th: ค่าเช่า

source: Refund
th: คืนเงิน

source: Additional
th: เพิ่มเติม

source: Pending
th: รอดำเนินการ

source: Minor
th: เล็กน้อย

source: Moderate
th: ปานกลาง

source: Major
th: รุนแรง

source: Waived
th: ยกเว้น

source: Insurance Claim
th: เคลมประกัน

source: Cash
th: เงินสด

source: Bank Transfer
th: โอนเงินผ่านธนาคาร

source: QR Code
th: คิวอาร์โค้ด (QR Code)

source: At Shop (Free)
th: ที่ร้าน (ฟรี)
