Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Components/Till/OverpaymentRefundDialog.*.resx
Languages: th

source: Overpayment Refund
th: คืนเงินจ่ายเกิน

# RefundExcessPayment
source: Refund the excess payment to the customer
th: คืนเงินส่วนเกินให้ลูกค้า

source: Original Payment
th: การชำระเงินเดิม

source: Total Paid
th: ยอดชำระทั้งหมด

source: Amount Due
th: ยอดที่ต้องชำระ

# NoPaymentData
source: No payment data available
th: ไม่มีข้อมูลการชำระเงิน

# OverpaymentAmount
source: Overpayment
th: ยอดจ่ายเกิน

source: Refund in Cash
th: คืนเป็นเงินสด

# RefundReason
source: Reason for Refund
th: เหตุผลในการคืนเงิน

# EnterRefundReason
source: Enter reason for refund...
th: ใส่เหตุผลในการคืนเงิน...

# ReasonRequired
source: Please enter a reason
th: กรุณาใส่เหตุผล

# ReasonTooShort
source: Reason must be at least 5 characters
th: เหตุผลต้องมีอย่างน้อย 5 ตัวอักษร

# TillBalanceWarning
source: Warning: Till THB balance ({0}) may not cover this refund
th: คำเตือน: ยอดเงินบาทในลิ้นชัก ({0}) อาจไม่เพียงพอสำหรับการคืนเงินนี้

source: Cancel
th: ยกเลิก

source: Issue Refund
th: คืนเงิน
