Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Components/Till/PaymentTerminalPanel.*.resx
Languages: th

source: Amount Due
th: ยอดที่ต้องชำระ

source: Payment Method
th: วิธีการชำระเงิน

source: Cash
th: เงินสด

source: Credit Card
th: บัตรเครดิต

source: PromptPay
th: พร้อมเพย์

source: AliPay
th: อาลีเพย์

source: Select Currency
th: เลือกสกุลเงิน

source: Payment Details
th: รายละเอียดการชำระ

# NoPaymentsYet
source: No payments added yet
th: ยังไม่มีการชำระเงิน

source: Total Received
th: รับเงินรวม

source: Change
th: เงินทอน

source: Remaining
th: ยอดคงเหลือ

source: Complete Payment
th: ดำเนินการชำระเงิน

source: Cancel
th: ยกเลิก

source: Coming Soon
th: เร็วๆ นี้

source: Enter Amount
th: ใส่จำนวนเงิน

source: Reference
th: เลขอ้างอิง

source: Remove
th: ลบ

# CountNotes
source: Count {0} Notes
th: นับธนบัตร {0}

source: Rate
th: อัตราแลกเปลี่ยน

# LoadingRate
source: Loading exchange rate...
th: กำลังโหลดอัตราแลกเปลี่ยน...

# NoRateConfigured
source: No exchange rate configured for {0}
th: ยังไม่มีอัตราแลกเปลี่ยนสำหรับ {0}

source: THB Equivalent
th: เทียบเท่าบาท

source: Add Payment
th: เพิ่มการชำระ

source: Amount
th: จำนวนเงิน

# EnterCardAmount
source: Enter Card Payment Amount
th: ใส่จำนวนเงินบัตร

# CardReference
source: Authorization Code (optional)
th: รหัสอนุมัติ (ไม่บังคับ)

source: Add Card Payment
th: เพิ่มการชำระด้วยบัตร

# PromptPayInstruction
source: Enter amount for PromptPay payment
th: ใส่จำนวนเงินสำหรับพร้อมเพย์

# PromptPayReference
source: Transaction Reference
th: เลขอ้างอิงรายการ

source: Add PromptPay Payment
th: เพิ่มการชำระพร้อมเพย์

# AliPayInstruction
source: Customer pays via AliPay app
th: ลูกค้าชำระผ่านแอป AliPay

# AliPayReference
source: Customer Confirmation Number
th: หมายเลขยืนยันของลูกค้า

# AliPayReferenceHelp
source: Enter the confirmation number from customer's AliPay app
th: ใส่หมายเลขยืนยันจากแอป AliPay ของลูกค้า

source: Add AliPay Payment
th: เพิ่มการชำระ AliPay

source: Pay Remaining
th: ชำระยอดคงเหลือ

source: Optional
th: ไม่บังคับ

source: Required
th: จำเป็น
