Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Components/Till/VoidTransactionDialog.*.resx
Languages: th

source: Void Transaction
th: ยกเลิกรายการ

# VoidTransactionDescription
source: This will reverse the transaction and update the till balance
th: การดำเนินการนี้จะย้อนรายการและปรับยอดเงินสดในลิ้นชัก

source: Original Transaction
th: รายการเดิม

source: Type
th: ประเภท

source: Direction
th: ทิศทาง

source: Amount
th: จำนวนเงิน

source: Time
th: เวลา

source: Description
th: รายละเอียด

source: Cash In
th: เงินเข้า

source: Cash Out
th: เงินออก

source: Manager Approval Required
th: ต้องการการอนุมัติจากผู้จัดการ

# VoidRequiresManagerPin
source: Voiding a transaction requires manager PIN approval
th: การยกเลิกรายการต้องได้รับการอนุมัติด้วยรหัส PIN ของผู้จัดการ

# VoidReason
source: Reason for Void
th: เหตุผลในการยกเลิก

# EnterVoidReason
source: Enter reason for voiding this transaction...
th: ใส่เหตุผลในการยกเลิกรายการนี้...

# ReasonRequired
source: Please enter a reason
th: กรุณาใส่เหตุผล

# ReasonTooShort
source: Reason must be at least 5 characters
th: เหตุผลต้องมีอย่างน้อย 5 ตัวอักษร

# VoidEffect
source: Effect on Till Balance
th: ผลกระทบต่อยอดเงินสด

# TillBalanceWillDecrease
source: Till balance will decrease by
th: ยอดเงินจะลดลง

# TillBalanceWillIncrease
source: Till balance will increase by
th: ยอดเงินจะเพิ่มขึ้น

source: Cancel
th: ยกเลิก

source: Rental Payment
th: ค่าเช่า

source: Booking Deposit
th: มัดจำการจอง

source: Check-In
th: เช็คอิน

source: Security Deposit
th: เงินประกัน

source: Damage Charge
th: ค่าเสียหาย

source: Late Fee
th: ค่าปรับล่าช้า

source: Surcharge
th: ค่าธรรมเนียมเพิ่มเติม

# MiscellaneousIncome
source: Miscellaneous
th: รายได้อื่นๆ

source: Top Up
th: เติมเงิน

source: Card Payment
th: บัตรเครดิต

source: Bank Transfer
th: โอนเงิน

source: PromptPay
th: พร้อมเพย์

source: Deposit Refund
th: คืนเงินประกัน

source: Fuel Reimbursement
th: คืนค่าน้ำมัน

source: Agent Commission
th: ค่าคอมมิชชั่น

source: Petty Cash
th: เงินสดย่อย

source: Cash Drop
th: นำเงินออก

source: Overpayment Refund
th: คืนเงินจ่ายเกิน
