Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Finance/AgentCommissions.*.resx
Languages: th

source: Agent Commissions
th: คอมมิชชั่นตัวแทน

source: Manage Payouts
th: จัดการการจ่ายเงิน

source: Approve Selected
th: อนุมัติที่เลือก

source: Pay Selected
th: จ่ายที่เลือก

source: Filters
th: ตัวกรอง

source: Agent
th: ตัวแทน

source: All Agents
th: ตัวแทนทั้งหมด

source: Status
th: สถานะ

source: All Statuses
th: ทุกสถานะ

source: Date Range
th: ช่วงวันที่

source: From
th: จาก

source: To
th: ถึง

source: Summary
th: สรุป

source: Pending
th: รอดำเนินการ

source: Approved
th: อนุมัติแล้ว

source: Paid
th: จ่ายแล้ว

source: Total Outstanding
th: ยอดค้างจ่ายรวม

source: Booking Ref
th: เลขที่จอง

source: Customer
th: ลูกค้า

source: Booking Total
th: ยอดรวมการจอง

source: Commission
th: คอมมิชชั่น

source: Date
th: วันที่

source: Rental not completed
th: การเช่ายังไม่เสร็จสิ้น

source: Approve
th: อนุมัติ

source: Pay
th: จ่ายเงิน

source: Void
th: ยกเลิก

source: No commissions found
th: ไม่พบคอมมิชชั่น

# AdjustFilters
source: Try adjusting your filters
th: ลองปรับตัวกรองของคุณ

source: Select Payment Method
th: เลือกวิธีชำระเงิน

source: Cash
th: เงินสด

source: Bank Transfer
th: โอนเงิน

source: PromptPay
th: พร้อมเพย์

source: Payment Reference
th: อ้างอิงการชำระเงิน

source: Enter reference (optional)
th: ใส่อ้างอิง (ไม่บังคับ)

source: Commission approved
th: อนุมัติคอมมิชชั่นแล้ว

source: Approval failed
th: การอนุมัติล้มเหลว

# CommissionsApproved
source: {0} commissions approved
th: อนุมัติ {0} คอมมิชชั่น

# PartialApproval
source: {0} approved, {1} failed
th: อนุมัติ {0}, ล้มเหลว {1}

source: Commission paid
th: จ่ายคอมมิชชั่นแล้ว

source: Payment failed
th: การชำระเงินล้มเหลว

# CommissionsPaid
source: {0} commissions paid
th: จ่าย {0} คอมมิชชั่น

# PartialPayment
source: {0} paid, {1} failed
th: จ่าย {0}, ล้มเหลว {1}

source: Void Reason
th: เหตุผลในการยกเลิก

# EnterReasonRequired
source: Please enter a reason (required)
th: กรุณาใส่เหตุผล (จำเป็น)

source: Commission voided
th: ยกเลิกคอมมิชชั่นแล้ว

source: Void failed
th: การยกเลิกล้มเหลว

source: Voided
th: ยกเลิกแล้ว

source: Pay Commission
th: จ่ายคอมมิชชั่น

source: Pay Commissions
th: จ่ายคอมมิชชั่น
