Repository: erymuzuan/motorent
Catalog: src/MotoRent.Client/Resources/Pages/Finance/Receipts.*.resx
Languages: th

source: Receipts
th: ใบเสร็จ

source: Finance
th: การเงิน

source: Receipt Type
th: ประเภทใบเสร็จ

source: All Types
th: ทุกประเภท

source: Check-In
th: เช็คอิน

source: Settlement
th: คืนรถ

source: Booking Deposit
th: มัดจำจอง

source: Status
th: สถานะ

source: All Status
th: ทุกสถานะ

source: Issued
th: ออกแล้ว

source: Voided
th: ยกเลิก

source: From
th: จาก

source: To
th: ถึง

source: Search
th: ค้นหา

# SearchPlaceholder
source: Receipt #, customer, phone...
th: เลขใบเสร็จ, ลูกค้า, โทรศัพท์...

source: Total Receipts
th: ใบเสร็จทั้งหมด

source: Check-Ins
th: เช็คอิน

source: Settlements
th: คืนรถ

source: Total Amount
th: ยอดรวม

# ReceiptNo
source: Receipt #
th: เลขใบเสร็จ

source: Type
th: ประเภท

source: Customer
th: ลูกค้า

source: Vehicle
th: รถ

source: Amount
th: จำนวนเงิน

source: Issued On
th: ออกเมื่อ

source: Actions
th: การกระทำ

source: No receipts found
th: ไม่พบใบเสร็จ

source: View/Print
th: ดู/พิมพ์

source: Void
th: ยกเลิก

# ShowingPage
source: Page {0} of {1} ({2} total)
th: หน้า {0} จาก {1} (ทั้งหมด {2})

# ErrorLoadingReceipts
source: Error loading receipts: {0}
th: ไม่สามารถโหลดใบเสร็จ: {0}

# VoidConfirmMessage
source: Are you sure you want to void receipt {0}? This action cannot be undone.
th: คุณแน่ใจหรือไม่ว่าต้องการยกเลิกใบเสร็จ {0}? การกระทำนี้ไม่สามารถย้อนกลับได้

source: Void Receipt
th: ยกเลิกใบเสร็จ

# VoidReasonPrompt
source: Please enter the reason for voiding this receipt:
th: กรุณาระบุเหตุผลในการยกเลิกใบเสร็จ:

source: Void Reason
th: เหตุผลการยกเลิก

# VoidReasonRequired
source: A reason is required to void a receipt
th: ต้องระบุเหตุผลในการยกเลิกใบเสร็จ

# ReceiptVoided
source: Receipt voided successfully
th: ยกเลิกใบเสร็จสำเร็จ

# VoidFailed
source: Failed to void receipt: {0}
th: ไม่สามารถยกเลิกใบเสร็จ: {0}
